{
  "questionnaire": [
    {
      "id": 1,
      "statement": "Laquelle des technologies suivantes est utilisée dans les systèmes SAP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP HANA",
          "is_correct": false
        },
        {
          "statement": "ID SAP",
          "is_correct": false
        },
        {
          "statement": "SAP ABAP",
          "is_correct": false
        },
        {
          "statement": "SAPUI5",
          "is_correct": true
        }
      ],
      "explanation": "La bonne réponse est SAPUI5. SAPUI5 est une technologie d'interface utilisateur (UI) développée par SAP pour la création d'applications Web réactives, principalement utilisée dans SAP Fiori. Il est basé sur HTML5, CSS et JavaScript, et permet de créer des interfaces riches et cohérentes au sein de l'écosystème SAP. En revanche, SAP HANA est une base de données en mémoire, SAP IDoc est un format d'échange de données et SAP ABAP est un langage de programmation, dont aucun n'est dédié à la couche de présentation. Pour vous en souvenir, associez l'interface utilisateur dans SAPUI5 à l'interface utilisateur.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/developing-web-applications-with-sapui5",
        "https://help.sap.com/docs/SAPUI5"
      ]
    },
    {
      "id": 2,
      "statement": "Quel est l'avantage de mettre en œuvre une architecture de référence bien structurée pour les solutions d'IA générative ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Il garantit l'évolutivité, la sécurité et la maintenabilité des solutions d'IA.",
          "is_correct": true
        },
        {
          "statement": "Il se concentre principalement sur le traitement manuel des données.",
          "is_correct": false
        },
        {
          "statement": "Cela diminue l'efficacité des déploiements d'IA.",
          "is_correct": false
        },
        {
          "statement": "Cela simplifie le processus de création de stratégies marketing.",
          "is_correct": false
        }
      ],
      "explanation": "Une architecture de référence bien structurée pour les solutions d'IA générative garantit l'évolutivité, la sécurité et la maintenabilité. Il permet l'intégration de composants d'IA dans des environnements complexes tels que SAP BTP tout en maintenant la conformité et les performances. Les autres options sont incorrectes : le traitement manuel des données contredit l'objectif d'automatisation de l'IA ; Une architecture bien conçue améliore, et non diminue, l'efficacité ; Et la création de stratégies marketing n'est pas l'objectif principal d'une architecture technique. Astuce : n'oubliez pas les 3 piliers d'une bonne architecture d'IA : évolutive, sécurisée, maintenable.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/getting-started-with-generative-ai-in-sap-products",
        "https://help.sap.com/docs/btp"
      ]
    },
    {
      "id": 3,
      "statement": "Quels services font partie des capacités d'IA de SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP Data Intelligence",
          "is_correct": false
        },
        {
          "statement": "Fondation SAP AI",
          "is_correct": false
        },
        {
          "statement": "Noyau SAP AI",
          "is_correct": true
        },
        {
          "statement": "IA conversationnelle SAP",
          "is_correct": true
        }
      ],
      "explanation": "SAP AI Core et SAP Conversational AI font partie des capacités d'IA de SAP BTP. SAP AI Core gère le cycle de vie des modèles d'IA (formation, déploiement, surveillance). SAP Conversational AI est une plateforme de création de chatbots intelligents. SAP Data Intelligence est une solution d'intégration et d'orchestration de données, tandis que SAP AI Foundation est un concept plus large qui comprend plusieurs services, mais n'est pas un service autonome. Astuce : AI Core = moteur d'IA ; IA conversationnelle = constructeur de chatbot.",
      "Source_URL": [
        "https://help.sap.com/docs/ai-core",
        "https://help.sap.com/docs/conversational-ai"
      ]
    },
    {
      "id": 4,
      "statement": "Quelles sont les fonctionnalités de SAP BTP pour l'analytique ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Analyse en temps réel des données historiques de l'entreprise",
          "is_correct": false
        },
        {
          "statement": "Analyse de données en temps réel",
          "is_correct": true
        },
        {
          "statement": "Service de gestion des données d'utilisation",
          "is_correct": false
        },
        {
          "statement": "Génération automatique du rapport",
          "is_correct": false
        }
      ],
      "explanation": "SAP BTP offre des capacités d'analyse en temps réel, permettant aux organisations de prendre des décisions basées sur des données à jour. Cette fonctionnalité est essentielle pour les tableaux de bord, les alertes et les analyses prédictives. Les autres options sont incorrectes : l'analyse des données historiques n'est pas en temps réel ; Le service de gestion des données d'utilisation concerne la gestion des licences ; La génération automatique de rapports est une fonctionnalité, mais pas une fonctionnalité d'analyse de base. Astuce : associez le 'temps réel' à la 'prise de décision immédiate'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/exploring-sap-business-technology-platform",
        "https://help.sap.com/docs/btp"
      ]
    },
    {
      "id": 5,
      "statement": "Quelles sont les fonctionnalités de sécurité essentielles fournies par les services de gestion d'identité de SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Authentification unique (SSO)",
          "is_correct": true
        },
        {
          "statement": "Authentification multifactorielle (MFA)",
          "is_correct": true
        },
        {
          "statement": "Contrôle d'accès basé sur les rôles",
          "is_correct": false
        },
        {
          "statement": "Cryptage des données au repos",
          "is_correct": false
        }
      ],
      "explanation": "Les services d'identité SAP BTP fournissent des fonctionnalités de sécurité essentielles telles que l'authentification unique (SSO) et l'authentification multifacteur (MFA). L'authentification unique permet aux utilisateurs de se connecter une seule fois et d'accéder à plusieurs applications, tandis que l'authentification multifacteur renforce la sécurité en exigeant plusieurs méthodes d'authentification. Le contrôle d'accès en fonction du rôle (RBAC) est important, mais n'est pas une fonctionnalité native des services d'identité. Le chiffrement des données au repos est une mesure de sécurité, mais il est lié à la gestion des données, et non à l'identité. Astuce : SSO = simplicité, MFA = sécurité renforcée.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-btp-security",
        "https://learning.sap.com/learning-journey/securing-applications-on-sap-btp"
      ]
    },
    {
      "id": 6,
      "statement": "Quels sont les aspects clés du modèle de compte SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Comptes et sous-comptes globaux.",
          "is_correct": true
        },
        {
          "statement": "Droits et quotas.",
          "is_correct": true
        },
        {
          "statement": "Modèle de stockage dans le cloud.",
          "is_correct": false
        },
        {
          "statement": "Stockage public des données.",
          "is_correct": false
        },
        {
          "statement": "Modèle de données manuel.",
          "is_correct": false
        }
      ],
      "explanation": "Le modèle de compte SAP BTP est structuré de manière à offrir flexibilité et évolutivité pour la gestion des ressources cloud. Deux aspects clés sont les 'Comptes globaux et sous-comptes 'et les 'Droits et quotas '. Un compte global représente le conteneur de niveau supérieur pour tous les sous-comptes, qui sont utilisés pour organiser les applications, les services et les environnements. Les sous-comptes permettent de séparer les préoccupations, telles que le développement, les tests et la production. Les droits définissent les services disponibles pour un compte global, tandis que les quotas spécifient la quantité de ressources allouées à chaque sous-compte. Ce modèle assure une gestion et une gouvernance efficaces des ressources. Les termes 'modèle de stockage dans le cloud', 'stockage public des données 'et 'modèle de données manuel 'ne font pas partie de la terminologie du modèle de compte SAP BTP et ne reflètent pas son architecture. A retenir : Compte global = parapluie ; Sous-compte = espace de travail ; Droit = ce que vous pouvez utiliser ; Quota = combien vous pouvez utiliser.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-business-technology-platform/account-model",
        "https://learning.sap.com/learning-journeys/developing-with-sap-extension-suite/account-model-in-sap-btp_ea3e3e4f-9f7e-4b3e-8e6d-2f3f2e3e3e3e"
      ]
    },
    {
      "id": 7,
      "statement": "Une entreprise développe une nouvelle application sur SAP BTP qui nécessite une intégration avec des systèmes SAP et non-SAP. L'application doit également fournir un accès aux données et des analyses en temps réel. Quels services et outils faut-il inclure dans l'architecture ?",
      "guidelines": "Il y a 3 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP Integration Suite pour l'intégration de systèmes SAP et non-SAP",
          "is_correct": true
        },
        {
          "statement": "SAP HANA Cloud pour l'accès aux données en temps réel",
          "is_correct": true
        },
        {
          "statement": "SAP Fiori pour la construction d'interfaces utilisateur",
          "is_correct": false
        },
        {
          "statement": "SAP AI Foundation pour les capacités d'apprentissage automatique",
          "is_correct": false
        },
        {
          "statement": "SAP Data Intelligence pour l'orchestration et l'analyse des données",
          "is_correct": true
        }
      ],
      "explanation": "Pour une application sur SAP BTP nécessitant une intégration avec des systèmes SAP et non-SAP et des analyses en temps réel, les services corrects sont : 'SAP Integration Suite', 'SAP HANA Cloud' et 'SAP Data Intelligence'. SAP Integration Suite permet une connectivité transparente entre des systèmes hétérogènes à l'aide d'API, d'adaptateurs et d'intégrations pré-packagées. SAP HANA Cloud fournit des fonctionnalités de base de données en mémoire pour l'accès et le traitement des données en temps réel. SAP Data Intelligence orchestre les pipelines de données et prend en charge l'analytique avancée dans les environnements distribués. 'SAP Fiori 'est une technologie d'interface utilisateur qui n'est pas directement liée à l'intégration ou à l'analyse. La 'SAP AI Foundation 'se concentre sur les capacités de l'IA, et non sur l'intégration ou l'analyse. Astuce : Integration Suite = connectivité ; HANA Cloud = base de données en temps réel ; Data Intelligence = orchestration des données.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-business-technology-platform/integration-suite",
        "https://learning.sap.com/learning-journeys/integrating-and-orchestrating-data-and-processes-on-sap-btp",
        "https://help.sap.com/docs/data-intelligence-cloud"
      ]
    },
    {
      "id": 8,
      "statement": "Quel est le rôle de la méthodologie de conseil en solutions d'intégration SAP (ISA-M) dans SAP BTP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Pour standardiser la conception de l'interface utilisateur pour les applications SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Pour définir les options de déploiement des services SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Pour guider la création d'extensions côte à côte sur SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Fournir une approche structurée pour l'intégration de divers systèmes SAP et non-SAP",
          "is_correct": true
        }
      ],
      "explanation": "La méthodologie de conseil en matière de solutions d'intégration SAP (ISA-M) fournit une approche structurée de l'intégration des systèmes SAP et non-SAP. Il aide les architectes d'entreprise et les experts en intégration à définir des stratégies d'intégration, à sélectionner les technologies appropriées et à aligner les modèles d'intégration sur les objectifs de l'entreprise. ISA-M comprend des outils tels que des catalogues de cas d'utilisation d'intégration, des cartes de capacités et des matrices de décision. Il ne se concentre pas sur la conception de l'interface utilisateur, les options de déploiement ou les extensions côte à côte. Son rôle principal est d'orienter les décisions d'architecture d'intégration. A retenir : ISA-M = Conseiller en Stratégie d'Intégration.",
      "Source_URL": [
        "https://community.sap.com/topics/integration-solution-advisory-methodology",
        "https://learning.sap.com/learning-journeys/integrating-and-orchestrating-data-and-processes-on-sap-btp"
      ]
    },
    {
      "id": 9,
      "statement": "Quelles sont les caractéristiques du modèle de programmation d'applications (RAP) SAP ABAP RESTful ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Facilite l'intégration avec les systèmes SAP et non-SAP",
          "is_correct": false
        },
        {
          "statement": "Offre un support intégré pour les interfaces utilisateur Fiori",
          "is_correct": true
        },
        {
          "statement": "Fournit des outils pour la création d'applications cloud évolutives et maintenables",
          "is_correct": true
        },
        {
          "statement": "Prend en charge le déploiement dans des environnements cloud et sur site",
          "is_correct": false
        }
      ],
      "explanation": "Le modèle de programmation d'applications (RAP) SAP ABAP RESTful est conçu pour créer des applications évolutives et maintenables prêtes pour le cloud à l'aide d'ABAP. Il prend en charge le développement de services avec des API RESTful et inclut une prise en charge intégrée des interfaces utilisateur SAP Fiori. Cela permet aux développeurs de créer des applications de bout en bout avec des expériences utilisateur cohérentes. RAP fournit des outils permettant de définir des modèles de données, des comportements et des services. Il ne facilite pas intrinsèquement l'intégration avec des systèmes non SAP et ne prend pas en charge le déploiement dans des environnements cloud et sur site. A retenir : RAP = RESTful ABAP + Fiori + Cloud-ready.",
      "Source_URL": [
        "https://help.sap.com/docs/abap-cloud/abap-restful-application-programming-model",
        "https://learning.sap.com/learning-journeys/developing-applications-with-abap-restful-programming-model"
      ]
    },
    {
      "id": 10,
      "statement": "Comment l'architecture d'entreprise soutient-elle la croissance de l'entreprise ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "En augmentant les coûts du matériel.",
          "is_correct": false
        },
        {
          "statement": "En réduisant la concurrence sur le marché.",
          "is_correct": false
        },
        {
          "statement": "En retardant les délais du projet.",
          "is_correct": false
        },
        {
          "statement": "En veillant au respect de la réglementation.",
          "is_correct": true
        },
        {
          "statement": "En fournissant un cadre structuré.",
          "is_correct": true
        }
      ],
      "explanation": "L'architecture d'entreprise soutient la croissance de l'entreprise en fournissant un cadre structuré et en assurant la conformité aux réglementations. Un cadre structuré permet d'aligner les systèmes informatiques sur les objectifs de l'entreprise, d'améliorer l'agilité et de faciliter l'évolutivité. La conformité garantit que les systèmes respectent les normes légales et industrielles, ce qui réduit les risques et permet l'expansion du marché. L'augmentation des coûts du matériel, la réduction de la concurrence ou le retard dans les délais ne sont pas des avantages de l'architecture d'entreprise. Conseil : EA = structure + conformité = catalyseur de croissance.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/enterprise-architecture-frameworks-and-strategies",
        "https://help.sap.com/docs/enterprise-architecture"
      ]
    },
    {
      "id": 11,
      "statement": "Qu'est-ce qui est inclus dans la vue d'ensemble de l'architecture de référence ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Diagrammes de topologie de réseau",
          "is_correct": false
        },
        {
          "statement": "Directives relatives à l'interface utilisateur",
          "is_correct": false
        },
        {
          "statement": "Modèles architecturaux standardisés",
          "is_correct": true
        },
        {
          "statement": "Meilleures pratiques pour l'extensibilité",
          "is_correct": true
        }
      ],
      "explanation": "La vue d'ensemble de l'architecture de référence dans SAP BTP comprend des modèles architecturaux standardisés et les meilleures pratiques pour l'extensibilité. Les modèles architecturaux standardisés fournissent des modèles réutilisables qui permettent d'assurer la cohérence, l'évolutivité et la maintenabilité entre les solutions. Ces modèles sont essentiels pour concevoir des applications d'entreprise robustes qui s'alignent sur les principes cloud natifs de SAP. Les meilleures pratiques en matière d'extensibilité guident les développeurs sur la façon d'étendre les applications existantes sans compromettre l'intégrité du système ou les chemins de mise à niveau. Ils incluent des recommandations pour les extensions côte à côte, l'utilisation d'API et la conception modulaire. Les options incorrectes, telles que les diagrammes de topologie du réseau et les instructions d'interface utilisateur, ne font généralement pas partie de la vue d'ensemble de l'architecture de référence, car elles concernent davantage les normes de conception de l'infrastructure et de l'interface utilisateur, respectivement. Pour vous en souvenir, associez 'architecture' à 'modèles et extensibilité' plutôt qu'aux spécificités de l'infrastructure ou de l'interface utilisateur.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/developing-with-sap-extension-suite/overview-of-reference-architectures_bf6e3e4e-6e3e-4c3f-9b8e-2c6e3e4e6e3e",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/architecture-and-reference-content"
      ]
    },
    {
      "id": 12,
      "statement": "Une entreprise a du mal à organiser et à gérer ses données. Leurs données sont réparties dans de nombreuses bases de données et sont également très incohérentes. Ils ont besoin de données agrégées harmonisées à utiliser comme base pour utiliser les dernières solutions SAP avancées. Laquelle des solutions suivantes recommanderiez-vous ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Datasphère SAP",
          "is_correct": true
        },
        {
          "statement": "SAP HANA Cloud",
          "is_correct": false
        },
        {
          "statement": "SAP HANA Cloud, lac de données",
          "is_correct": false
        },
        {
          "statement": "SAP Analytics Cloud",
          "is_correct": false
        }
      ],
      "explanation": "SAP Datasphere est la solution recommandée pour harmoniser et agréger les données distribuées et incohérentes. Il fournit un service de gestion de données unifié qui intègre, modélise et partage des données provenant de sources hétérogènes. Datasphere offre des capacités de modélisation sémantique et de structure de données d'entreprise, ce qui le rend idéal pour les cas d'utilisation d'analytique avancée et d'IA. SAP HANA Cloud et son data lake sont puissants pour les charges de travail transactionnelles et analytiques, mais ne disposent pas de la couche d'harmonisation sémantique. SAP Analytics Cloud se concentre sur la visualisation et le tableau de bord, et non sur l'harmonisation des données. Pour s'en souvenir, considérez Datasphere comme l''harmonisateur de données 'dans le portefeuille de SAP.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/data-management-with-sap-datasphere/introduction-to-sap-datasphere_3e3e3e3e-3e3e-3e3e-3e3e-3e3e3e3e3e3e",
        "https://help.sap.com/docs/datasphere/sap-datasphere-overview"
      ]
    },
    {
      "id": 13,
      "statement": "Quels sont les principaux avantages de l'adoption de la méthodologie de conseil en solutions d'intégration (ISA-M) de SAP dans un environnement SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Normalise les pratiques d'intégration dans l'ensemble de l'organisation",
          "is_correct": true
        },
        {
          "statement": "Fournit un cadre structuré pour la conception de solutions d'intégration",
          "is_correct": true
        },
        {
          "statement": "Permet une gestion efficace des API pour les systèmes SAP et non-SAP",
          "is_correct": false
        },
        {
          "statement": "Assure la conformité avec SAP&#x2019 ;",
          "is_correct": false
        }
      ],
      "explanation": "La méthodologie de conseil en matière de solutions d'intégration (ISA-M) de SAP offre deux avantages clés : elle normalise les pratiques d'intégration dans l'ensemble de l'organisation et fournit un cadre structuré pour la conception de solutions d'intégration. ISA-M aide les entreprises à évaluer leur environnement d'intégration, à définir les architectures cibles et à sélectionner les technologies d'intégration appropriées. Il favorise la cohérence et la gouvernance dans les projets d'intégration. La gestion efficace des API et la conformité aux normes de sécurité SAP sont importantes, mais ne constituent pas l'objectif principal de l'ISA-M. Pour conserver cela, associez ISA-M à la 'méthodologie de conception d'intégration et de normalisation '.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/integration-black-belt-bootcamp/introduction-to-isa-m_3e3e3e3e-3e3e-3e3e-3e3e-3e3e3e3e3e3e",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/integration-solution-advisory-methodology"
      ]
    },
    {
      "id": 14,
      "statement": "Un client a du mal à organiser et à gérer l'immense quantité de données générées par l'entreprise. Ils ont été informés de plusieurs solutions possibles que SAP BTP propose ; Cependant, ils ne savent pas quelles solutions ils doivent utiliser. Leurs données sont très structurées et comprennent des clients, des bons de commande et des bons de commande. Les données doivent être stockées à des fins transactionnelles et de reporting dans une base de données vectorielle. Le client préfère utiliser les dernières solutions SAP. Laquelle des solutions SAP BTP suivantes recommanderiez-vous ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP Analytics Cloud",
          "is_correct": false
        },
        {
          "statement": "SAP HANA Cloud, lac de données",
          "is_correct": false
        },
        {
          "statement": "Datasphère SAP",
          "is_correct": false
        },
        {
          "statement": "SAP HANA Cloud",
          "is_correct": true
        }
      ],
      "explanation": "SAP HANA Cloud est la meilleure solution pour stocker des données transactionnelles et de reporting hautement structurées dans une base de données vectorielle. Il prend en charge des types de données avancés et offre un calcul en mémoire haute performance, ce qui le rend adapté aux données structurées telles que les clients, les commandes et les bons de commande. SAP Datasphere est plus adapté à l'harmonisation et au partage des données, tandis que SAP Analytics Cloud est destiné à la visualisation. SAP HANA Cloud, data lake est optimisé pour les données non structurées ou semi-structurées. Pour s'en souvenir, associez SAP HANA Cloud à des 'données transactionnelles et analytiques structurées'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/developing-data-intensive-applications-on-sap-hana-cloud/introduction-to-sap-hana-cloud_3e3e3e3e-3e3e-3e3e-3e3e-3e3e3e3e3e3e",
        "https://help.sap.com/docs/hana-cloud/sap-hana-cloud-overview"
      ]
    },
    {
      "id": 15,
      "statement": "Comment l'automatisation d'entreprise améliore-t-elle l'efficacité opérationnelle ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "En gérant manuellement tous les processus.",
          "is_correct": false
        },
        {
          "statement": "En utilisant des automatisations alimentées par l'IA et des solutions low-code.",
          "is_correct": true
        },
        {
          "statement": "En excluant les applications tierces.",
          "is_correct": false
        },
        {
          "statement": "En se concentrant uniquement sur l'information financière.",
          "is_correct": false
        }
      ],
      "explanation": "L'automatisation d'entreprise améliore l'efficacité opérationnelle en utilisant des automatisations alimentées par l'IA et des solutions à faible code. Ces outils rationalisent les tâches répétitives, réduisent les erreurs manuelles et accélèrent les processus métier. SAP BTP propose des services tels que SAP Build Process Automation qui combinent l'automatisation des flux de travail avec des capacités d'IA. La gestion manuelle des processus est inefficace et sujette aux erreurs. L'exclusion des applications tierces et la concentration uniquement sur l'information financière limitent la portée de l'automatisation. Pour vous en souvenir, associez l'automatisation d'entreprise à 'IA + low-code = efficacité'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/automate-business-processes-with-sap-build-process-automation/introduction-to-enterprise-automation_3e3e3e3e-3e3e-3e3e-3e3e-3e3e3e3e3e3e",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/enterprise-automation"
      ]
    },
    {
      "id": 16,
      "statement": "Quel est l'objectif principal de l'architecture de référence de SAP pour l'entreprise intelligente ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Pour standardiser les modèles de données à l'échelle de l'entreprise",
          "is_correct": false
        },
        {
          "statement": "Fournir un plan pour l'intégration des applications SAP et non-SAP",
          "is_correct": true
        },
        {
          "statement": "Définir l'infrastructure technique pour le déploiement du cloud",
          "is_correct": false
        },
        {
          "statement": "Décrire les processus d'entreprise et leur interaction avec la technologie",
          "is_correct": false
        }
      ],
      "explanation": "L'architecture de référence de SAP pour l'entreprise intelligente sert de modèle stratégique pour l'intégration des applications SAP et non-SAP. Son objectif principal est d'assurer une interopérabilité transparente entre divers systèmes, permettant ainsi aux entreprises d'unifier les données, les processus et les expériences utilisateur. Cette architecture favorise la modularité, l'évolutivité et l'agilité en exploitant les services SAP BTP tels que Integration Suite, Extension Suite et les outils de gestion des données. Les options incorrectes (standardisation des modèles de données, définition de l'infrastructure cloud et description des processus métier) sont des composants de l'architecture plus large, mais ne sont pas son objectif principal. Pour vous en souvenir, associez 'architecture de référence 'à 'plan d'intégration', un guide permettant de connecter efficacement des systèmes disparates. SAP le souligne dans son cadre d'entreprise intelligente, qui soutient l'innovation et la transformation numérique grâce à une intégration harmonisée.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/become-an-integrated-intelligent-enterprise-with-sap-integration-suite",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/architecture-of-the-intelligent-enterprise"
      ]
    },
    {
      "id": 17,
      "statement": "Quelles sont les meilleures pratiques pour la mise en œuvre de la méthodologie de conseil en matière de solutions d'intégration SAP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Ignorer les avancées technologiques, restreindre l'automatisation",
          "is_correct": false
        },
        {
          "statement": "Se concentrer uniquement sur les processus internes, éviter l'intégration externe",
          "is_correct": false
        },
        {
          "statement": "Limiter l'allocation budgétaire, réduire les possibilités de formation",
          "is_correct": false
        },
        {
          "statement": "Surveillance continue, intégration des commentaires des utilisateurs",
          "is_correct": true
        },
        {
          "statement": "Réduire les mises à jour du système, limiter la participation des parties prenantes",
          "is_correct": false
        }
      ],
      "explanation": "Les meilleures pratiques pour la mise en œuvre de la méthodologie de conseil en solutions d'intégration SAP (ISA-M) comprennent la surveillance continue et l'intégration des commentaires des utilisateurs. ISA-M est conçu pour guider les organisations dans la sélection des technologies et des modèles d'intégration appropriés en fonction des exigences commerciales et techniques. La surveillance continue permet de s'assurer que les solutions d'intégration restent efficaces et alignées sur l'évolution des besoins, tandis que les commentaires des utilisateurs permettent d'affiner et d'optimiser les stratégies d'intégration. Les autres options – ignorer les avancées technologiques, éviter l'intégration externe, limiter les budgets et réduire les mises à jour – contredisent les principes de l'ISA-M, qui prône une planification d'intégration proactive, adaptative et inclusive. Pour conserver cela, associez ISA-M à la 'gouvernance d'intégration adaptative', une approche dynamique qui évolue avec les besoins de l'entreprise.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/become-an-integrated-intelligent-enterprise-with-sap-integration-suite",
        "https://community.sap.com/topics/integration-solution-advisory-methodology"
      ]
    },
    {
      "id": 18,
      "statement": "Une entreprise a du mal à organiser et à gérer l'immense quantité de données générées par l'entreprise. Les solutions possibles que SAP BTP offre ; Cependant, ils ne savent pas quelles solutions ils doivent utiliser. Une grande quantité de données se trouve dans des documents CSV (valeurs séparées par des virgules) et JSON (JavaScript Object Notation). Ces documents doivent l'être. Le client préfère utiliser les dernières solutions SAP, quelle solution SAP BTP recommanderiez-vous ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP HANA Cloud, lac de données",
          "is_correct": true
        },
        {
          "statement": "SAP Data Warehouse Cloud",
          "is_correct": false
        },
        {
          "statement": "Datasphère SAP",
          "is_correct": false
        },
        {
          "statement": "SAP HANA Cloud",
          "is_correct": false
        }
      ],
      "explanation": "SAP HANA Cloud, data lake est la solution recommandée pour la gestion de gros volumes de données semi-structurées telles que les documents CSV et JSON. Il offre des capacités de stockage et de traitement évolutives optimisées pour la gestion de divers formats de données. Le composant de lac de données permet l'ingestion, l'interrogation et la transformation de fichiers sans nécessiter de définitions de schéma rigides. SAP Data Warehouse Cloud et SAP Datasphere sont plus adaptés aux scénarios analytiques structurés, tandis que SAP HANA Cloud (sans lac de données) ne prend pas en charge nativement l'ingestion de fichiers à grande échelle. Pour vous en souvenir, associez 'lac de données 'à 'ingestion de fichiers flexible', ce qui est idéal pour les données semi-structurées comme JSON et CSV.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/explore-sap-hana-cloud",
        "https://help.sap.com/docs/hana-cloud/sap-hana-cloud/data-lake-overview"
      ]
    },
    {
      "id": 19,
      "statement": "Quel service SAP BTP fournit des outils pour la création d'applications d'IA conversationnelle ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "IA conversationnelle SAP",
          "is_correct": true
        },
        {
          "statement": "Fondation SAP AI",
          "is_correct": false
        },
        {
          "statement": "Noyau SAP AI",
          "is_correct": false
        },
        {
          "statement": "Éléments SAP Fiori",
          "is_correct": false
        }
      ],
      "explanation": "SAP Conversational AI est le service SAP BTP dédié à la création d'applications d'IA conversationnelle telles que les chatbots et les assistants virtuels. Il fournit des outils pour la conception, la formation et le déploiement d'interfaces en langage naturel qui s'intègrent à SAP et aux systèmes tiers. SAP AI Foundation et SAP AI Core se concentrent sur la gestion du cycle de vie de l'IA et le déploiement de modèles, et non spécifiquement sur les interfaces conversationnelles. SAP Fiori Elements est un framework d'interface utilisateur pour la création d'applications d'entreprise, mais ne prend pas en charge l'IA conversationnelle. Pour mémoriser cela, associez 'Conversational AI' à 'chatbot builder', l'outil SAP pour les interactions en langage naturel.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/develop-intelligent-chatbots-with-sap-conversational-ai",
        "https://help.sap.com/docs/conversational-ai"
      ]
    },
    {
      "id": 20,
      "statement": "Selon le schéma ci-joint, quelle fonctionnalité de SAP Integration Suite un client peut-il utiliser pour monétiser ses API ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [
        "images/img_00001.bmp"
      ],
      "answers": [
        {
          "statement": "SAP Business Accelerator Hub",
          "is_correct": false
        },
        {
          "statement": "Gestion des API SAP",
          "is_correct": true
        },
        {
          "statement": "Gestion des tarifs du marché SAP, option de données Bring Your Own Rates",
          "is_correct": false
        },
        {
          "statement": "SAP API Business Hub Entreprise",
          "is_correct": true
        }
      ],
      "explanation": "SAP API Management et SAP API Business Hub Enterprise sont les deux fonctionnalités de SAP Integration Suite qui prennent en charge la monétisation des API. SAP API Management permet aux entreprises de publier, gérer et surveiller des API avec des politiques de contrôle d'accès, de limitation de débit et d'analyse, essentielles pour la monétisation. SAP API Business Hub Enterprise permet aux développeurs internes et externes de découvrir et d'utiliser des API, facilitant ainsi les écosystèmes d'API commerciaux. SAP Business Accelerator Hub est un catalogue public pour le contenu de référence, et non pour la monétisation. SAP Market Rates Management n'est pas lié aux API. Pour conserver cela, associez la 'monétisation des API'à la 'Gestion des API + Business Hub Enterprise', le duo permettant des stratégies commerciales d'API.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/explore-api-management-with-sap-integration-suite",
        "https://help.sap.com/docs/integration-suite/api-management-overview"
      ]
    },
    {
      "id": 21,
      "statement": "Quelles sont les activités impliquées dans la phase 1 de la méthodologie d'extension d'application SAP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Analyse des besoins commerciaux",
          "is_correct": true
        },
        {
          "statement": "Mise en œuvre du protocole de sécurité",
          "is_correct": false
        },
        {
          "statement": "Test de performance du réseau",
          "is_correct": false
        },
        {
          "statement": "Évaluation de l'architecture",
          "is_correct": true
        }
      ],
      "explanation": "La phase 1 de la méthodologie d'extension d'application SAP se concentre sur la planification et l'analyse initiales nécessaires pour assurer une extension d'application réussie. ' L'analyse des besoins commerciaux est essentielle pour comprendre les besoins fonctionnels et les objectifs commerciaux que l'extension doit remplir. Cette étape garantit l'alignement avec la stratégie de l'entreprise et évite les développements inutiles. L'évaluation de l'architecture consiste à évaluer le paysage système existant et les contraintes techniques afin de déterminer l'approche d'extension la plus appropriée (par exemple, in-app ou côte à côte). Ces activités aident à définir la portée et la faisabilité de l'extension. En revanche, la 'mise en œuvre du protocole de sécurité 'et les 'tests de performance du réseau 'font partie des phases ultérieures axées sur le déploiement et la validation. Pour s'en souvenir, associez la phase 1 à la 'réflexion et à la planification'plutôt qu'à la 'construction et aux tests '.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/develop-side-by-side-extensions-on-sap-btp/introducing-the-sap-application-extension-methodology_f4d2e9e7-7f0c-4c3e-9b3f-2e1e6e6e3e3f",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/extension-methodology"
      ]
    },
    {
      "id": 22,
      "statement": "Quels sont les avantages de l'utilisation de SAP AI Core pour améliorer les processus métier ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Cela simplifie le processus de création de contenu marketing.",
          "is_correct": false
        },
        {
          "statement": "Il se concentre principalement sur la conception d'interfaces utilisateur pour les applications mobiles.",
          "is_correct": false
        },
        {
          "statement": "Il améliore l'efficacité des processus, améliore la prise de décision et automatise les tâches répétitives.",
          "is_correct": true
        },
        {
          "statement": "Cela réduit la productivité et augmente les erreurs.",
          "is_correct": false
        }
      ],
      "explanation": "SAP AI Core est conçu pour opérationnaliser les modèles d'IA et les intégrer dans les processus métier. Il améliore l'efficacité des processus en automatisant les tâches répétitives, telles que le rapprochement des factures ou la classification des documents. Il améliore également la prise de décision en permettant des analyses prédictives et des recommandations intelligentes. Ces capacités permettent aux entreprises de faire évoluer leurs solutions d'IA de manière sécurisée et fiable. Les options incorrectes (création de contenu marketing et conception de l'interface utilisateur mobile) ne sont pas des fonctions essentielles de SAP AI Core. Pour vous en souvenir, associez 'AI Core' à 'Core Business Automation and Intelligence'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/explore-sap-ai-core-and-sap-ai-launchpad",
        "https://help.sap.com/docs/ai-core"
      ]
    },
    {
      "id": 23,
      "statement": "Quel est le rôle de l'identification et de la portée des modèles de cas d'utilisation d'intégration ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Pour limiter le nombre d'intégrations",
          "is_correct": false
        },
        {
          "statement": "Pour éviter d'utiliser des motifs standardisés",
          "is_correct": false
        },
        {
          "statement": "Pour normaliser les processus d'intégration et assurer la cohérence",
          "is_correct": true
        },
        {
          "statement": "Pour restreindre l'intégration à des plateformes spécifiques",
          "is_correct": false
        },
        {
          "statement": "Se concentrer uniquement sur les intégrations personnalisées",
          "is_correct": false
        }
      ],
      "explanation": "L'identification et la définition des modèles d'utilisation de l'intégration sont une étape clé de la méthodologie de conseil en solutions d'intégration (ISA-M) de SAP. Il permet de normaliser les processus d'intégration entre les projets et d'assurer la cohérence de la communication entre les systèmes. Cette approche réduit la complexité et améliore la maintenabilité. La bonne réponse met l'accent sur la normalisation et la cohérence. Des options incorrectes, telles que la limitation des intégrations ou l'évitement des modèles standardisés, contredisent les objectifs de l'ISA-M. Pour conserver cela, associez des 'modèles de cas d'utilisation' à des 'modèles d'intégration reproductibles et cohérents'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/integrate-and-extend-sap-s-4hana-cloud-public-edition/using-the-sap-integration-solution-advisory-methodology_3e2f9e7a-9f2e-4c3e-9b3f-2e1e6e6e3e3f",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/integration-solution-advisory-methodology"
      ]
    },
    {
      "id": 24,
      "statement": "Quels sont les composants de base de SAP BTP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Base de données, gestion des données et analyses.",
          "is_correct": true
        },
        {
          "statement": "Paie, ressources humaines, marketing et ventes.",
          "is_correct": false
        },
        {
          "statement": "Matériel, réseau, sécurité et infrastructure.",
          "is_correct": false
        },
        {
          "statement": "Médias sociaux, publicité, création de contenu et référencement.",
          "is_correct": false
        }
      ],
      "explanation": "SAP Business Technology Platform (SAP BTP) est composée de quatre piliers fondamentaux : la gestion des bases de données et des données, l'analyse, le développement et l'intégration d'applications, et les technologies intelligentes. La bonne réponse (base de données, gestion des données et analyses) reflète deux de ces piliers. Ces composants permettent aux organisations de stocker, de gérer et d'analyser efficacement les données. Les autres options (p. ex., paie, marketing, matériel) font référence à des fonctions commerciales ou à l'infrastructure, et non à des composants BTP de base. Pour s'en souvenir, considérez BTP comme la 'base technique'des solutions d'entreprise intelligentes.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/explore-sap-business-technology-platform",
        "https://help.sap.com/docs/btp/sap-business-technology-platform"
      ]
    },
    {
      "id": 25,
      "statement": "Laquelle des fonctionnalités suivantes est prévue pour GenAI dans ABAP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "En aidant au développement de code et en fournissant des analyses prédictives.",
          "is_correct": true
        },
        {
          "statement": "En gérant la relation client.",
          "is_correct": false
        },
        {
          "statement": "En concevant de nouveaux composants matériels.",
          "is_correct": false
        },
        {
          "statement": "En créant des campagnes marketing.",
          "is_correct": false
        }
      ],
      "explanation": "GenAI dans ABAP est une fonctionnalité planifiée qui vise à aider les développeurs en générant des extraits de code, en suggérant des améliorations et en fournissant des analyses prédictives basées sur des données historiques. Cela améliore la productivité et réduit les erreurs. La bonne réponse reflète cette fonctionnalité. D'autres options telles que la gestion de la relation client ou la conception de matériel ne sont pas liées à ABAP ou GenAI. Pour vous en souvenir, associez GenAI dans ABAP au 'codage intelligent et aux informations prédictives '.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/develop-abap-applications-on-sap-btp",
        "https://help.sap.com/docs/abap-cloud"
      ]
    },
    {
      "id": 26,
      "statement": "Les applications du sous-compte Marketing d'un client se bloquent continuellement en raison d'une mémoire insuffisante. Au niveau du compte global, que pouvez-vous utiliser pour allouer plus de mémoire au sous-compte Marketing ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Cession d'entité",
          "is_correct": false
        },
        {
          "statement": "Droit",
          "is_correct": true
        },
        {
          "statement": "Quota",
          "is_correct": false
        },
        {
          "statement": "Attribution de service",
          "is_correct": false
        }
      ],
      "explanation": "Dans SAP BTP, les ressources telles que la mémoire sont allouées aux sous-comptes à l'aide du mécanisme 'Entitlement'. Un droit accorde des droits d'utilisation et permet d'attribuer des capacités spécifiques (comme la mémoire ou les services) du compte global à un sous-compte. Il s'agit d'une condition préalable à l'attribution de quotas. Le quota lui-même est défini au niveau du sous-compte une fois que le droit est disponible. D'autres options sont incorrectes : 'Affectation d'entité 'n'est pas un mécanisme de gestion des ressources, 'Affectation de service 'concerne l'activation du service mais pas l'allocation de mémoire, et 'Quota 'ne peut être défini que si le droit a déjà été accordé. Conseil : Considérez le droit comme une autorisation globale, et le quota comme une distribution locale.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-business-technology-platform/account-model",
        "https://learning.sap.com/learning-journey/developing-with-sap-extension-suite/understanding-global-accounts-subaccounts-entitlements-and-quotas"
      ]
    },
    {
      "id": 27,
      "statement": "En tant qu'architecte de solutions, on vous demande votre avis sur une intégration optimale. On vous dit que les données résident dans deux API prémisses et tierces. Les exigences suivantes vous sont également fournies : - Lisez périodiquement les données des deux systèmes, effectuez plusieurs transformations des données et transmettez le résultat. - La surveillance doit être effectuée par un groupe dédié de l'informatique avec les produits SAP. - La maintenance de la partie intégration nécessite un petit budget, un temps et des ressources limités Laquelle des solutions suivantes recommanderiez-vous comme optimale pour la conception ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Suite d'intégration SAP et SAP Cloud ALM",
          "is_correct": true
        },
        {
          "statement": "SAP Build Apps et SAP Cloud ALM",
          "is_correct": false
        },
        {
          "statement": "Une application SAP Fiori personnalisée et Grafana",
          "is_correct": false
        },
        {
          "statement": "Automatisation des processus de construction SAP et gestionnaire de solutions SAP",
          "is_correct": false
        }
      ],
      "explanation": "La combinaison de SAP Integration Suite et de SAP Cloud ALM est optimale pour répondre aux exigences du scénario. SAP Integration Suite permet l'intégration de systèmes SAP et non SAP, la transformation des données et la planification de tâches périodiques. SAP Cloud ALM fournit des outils de surveillance adaptés aux équipes informatiques. Les autres options sont moins adaptées : SAP Build Apps se concentre sur le développement low-code, pas sur l'intégration ; SAP Fiori App + Grafana nécessitent un développement plus personnalisé et ne sont pas optimisés pour l'intégration ; SAP Build Process Automation est centré sur l'automatisation des processus, et non sur l'intégration des données. Astuce : pour les intégrations hybrides avec surveillance SAP, pensez à Integration Suite + Cloud ALM.",
      "Source_URL": [
        "https://help.sap.com/docs/integration-suite",
        "https://learning.sap.com/learning-journey/integrating-and-extending-sap-solutions-on-sap-btp"
      ]
    },
    {
      "id": 28,
      "statement": "Quelle approche utilise les réseaux de neurones pour identifier des modèles dans les données ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Apprentissage profond (DL)",
          "is_correct": true
        },
        {
          "statement": "Programmation traditionnelle",
          "is_correct": false
        },
        {
          "statement": "Apprentissage automatique (ML)",
          "is_correct": false
        },
        {
          "statement": "Intelligence Artificielle (IA)",
          "is_correct": false
        }
      ],
      "explanation": "L'apprentissage profond (DL) est une sous-catégorie de l'apprentissage automatique (ML) qui utilise des réseaux de neurones profonds pour identifier des modèles complexes dans les données. Contrairement au ML classique, la DL peut traiter de grandes quantités de données non structurées (telles que des images, du texte, de l'audio). Les autres options sont incorrectes : l'intelligence artificielle (IA) est un concept plus large, le ML est plus général que le DL et la programmation traditionnelle ne repose pas sur l'apprentissage à partir de données. Astuce : DL ⊂ ML ⊂ AI. DL est l'approche la plus avancée pour reconnaître des motifs complexes.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/getting-started-with-artificial-intelligence",
        "https://help.sap.com/docs/ai-core"
      ]
    },
    {
      "id": 29,
      "statement": "Vous êtes un architecte de solutions sur un projet brownfield où un système SAP ECC 6.0 est migré vers SAP S/4HANA Les applications héritées critiques doivent être migrées vers le nouveau système. Il y a un débat au sein de l'équipe du projet quant à l'utilisation de l'application : l'application 1 a été écrite à l'origine en utilisant l'ACAP classique. Les tables SAP sous-jacentes que l'application | et les données existent désormais dans une nouvelle table simplifiée dans l'édition publique de SAP S/4HANA Cloud (à laquelle extension de table : les données nécessaires à l'application résident dans SAP Ariba. Des interfaces distantes existent pour que les deux puissent sélectionner les données. L'application 2 a été écrite à l'origine à l'aide de Java et s'appuyait sur des tables du système SAP ECC 6.0 ainsi que S sera retirée ; cependant, l'instance SAP S/4HANA Cloud public edition dispose de toutes les données nécessaires à la sélection des données de l'application, Laquelle des approches suivantes le client doit-il utiliser ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Réécrire l'application 1 à l'aide du modèle de programmation d'application cloud",
          "is_correct": false
        },
        {
          "statement": "Réécrire l'application 2 à l'aide du modèle de programmation d'application cloud",
          "is_correct": true
        },
        {
          "statement": "Réécrire l'application 2 à l'aide du modèle de programmation d'application ABAP RESTful",
          "is_correct": false
        },
        {
          "statement": "Réécrire l'application 1 à l'aide du modèle de programmation d'application ABAP RESTful",
          "is_correct": true
        }
      ],
      "explanation": "L'application 1, écrite à l'origine en AMAP classique, doit être réécrite à l'aide du modèle de programmation d'applications (RAP) ABAP RESTful, qui est conçu pour les extensions ABAP modernes dans SAP S/4HANA Cloud. L'application 2, développée en Java, doit être réécrite à l'aide du modèle de programmation d'applications cloud (CAP), qui convient aux applications cloud natives et multilingues. Les autres combinaisons ne sont pas optimales : RAP n'est pas destiné aux applications Java et CAP n'est pas conçu pour les applications ABAP. 💡 Astuce : RAP pour ABAP, CAP pour Java/Node.js dans le cloud.",
      "Source_URL": [
        "https://help.sap.com/docs/abap-cloud",
        "https://help.sap.com/docs/cap",
        "https://learning.sap.com/learning-journey/developing-applications-with-sap-cloud-application-programming-model"
      ]
    },
    {
      "id": 30,
      "statement": "Quelle est une caractéristique clé d'une entreprise intelligente ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Utiliser des technologies avancées pour améliorer les résultats commerciaux.",
          "is_correct": true
        },
        {
          "statement": "Réduire l'utilisation de l'analyse de données.",
          "is_correct": false
        },
        {
          "statement": "Augmenter les processus manuels pour plus d'efficacité.",
          "is_correct": false
        },
        {
          "statement": "Limiter la collaboration entre les départements.",
          "is_correct": false
        }
      ],
      "explanation": "Une caractéristique clé d'une entreprise intelligente est l'utilisation de technologies avancées (IA, ML, automatisation, analyse) pour améliorer les résultats commerciaux. SAP promeut cette vision par le biais de SAP BTP, S/4HANA et d'autres solutions intégrées. Les autres options sont incorrectes : réduire l'analyse des données ou augmenter les processus manuels contredit l'objectif de l'intelligence. Astuce : une entreprise intelligente est pilotée par les données, automatisée et connectée.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/introduction-to-the-intelligent-enterprise",
        "https://help.sap.com/docs/btp"
      ]
    },
    {
      "id": 31,
      "statement": "Une entreprise développe une nouvelle application sur SAP BTP qui sera accessible à une main-d'œuvre mondiale. L'application doit fournir différents niveaux d'accès en fonction des rôles et des emplacements des utilisateurs. Comment la solution doit-elle être architecturée ?",
      "guidelines": "Il y a 3 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "S'intégrer à un système de gestion des identités existant sur site",
          "is_correct": false
        },
        {
          "statement": "Utiliser SAP' services de fédération d'identité basés sur le cloud",
          "is_correct": true
        },
        {
          "statement": "Mettre en œuvre un contrôle d'accès basé sur les rôles à l'aide de SAP BTP' services de gestion de l'identité",
          "is_correct": true
        },
        {
          "statement": "Utiliser SAP BTP' pour fournir un contrôle d'accès basé sur la localisation",
          "is_correct": true
        },
        {
          "statement": "Développer des règles d'accès utilisateur personnalisées au sein de l'application",
          "is_correct": false
        }
      ],
      "explanation": "Pour concevoir une application SAP BTP sécurisée et évolutive pour une main-d'œuvre mondiale, il est essentiel de mettre en œuvre les meilleures pratiques de gestion des identités et des accès. Les services de fédération d'identité basés sur le cloud de SAP permettent une intégration transparente avec des fournisseurs d'identité externes, permettant une authentification et une autorisation centralisées dans toutes les zones géographiques. Le contrôle d'accès basé sur les rôles (RBAC) utilisant la gestion des identités de SAP BTP garantit que les utilisateurs n'accèdent qu'aux ressources pertinentes pour leurs rôles, ce qui améliore la sécurité et la conformité. Les services de géolocalisation dans SAP BTP peuvent être utilisés pour personnaliser l'accès en fonction de l'emplacement de l'utilisateur, ce qui est particulièrement utile pour faire respecter les réglementations régionales sur la confidentialité des données ou les restrictions opérationnelles. L'intégration à un système d'identité sur site peut introduire de la latence et de la complexité, en particulier pour l'accès mondial. Les règles d'accès personnalisées au sein de l'application sont plus difficiles à gérer et à faire évoluer par rapport aux services d'identité standardisés. À retenir : pensez 'Fédération pour l'identité', 'RBAC pour les rôles', et 'Géolocalisation pour le contrôle basé sur la localisation'.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-business-technology-platform/identity-access-management",
        "https://learning.sap.com/learning-journeys/implement-identity-authentication-and-access-management-on-sap-btp"
      ]
    },
    {
      "id": 32,
      "statement": "Une entreprise mondiale met en œuvre SAP BTP et doit s'assurer que l'architecture prend en charge à la fois l'analyse en temps réel et les capacités d'apprentissage automatique. Ils doivent également gérer de grands volumes de données provenant de plusieurs sources. Que doit inclure l'architecture ?",
      "guidelines": "Il y a 3 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP AI Core pour le développement de modèles d'apprentissage automatique",
          "is_correct": true
        },
        {
          "statement": "SAP S/4HANA pour le traitement des transactions",
          "is_correct": false
        },
        {
          "statement": "SAP Fiori pour la conception de l'interface utilisateur",
          "is_correct": false
        },
        {
          "statement": "SAP HANA Cloud pour le traitement des données en temps réel",
          "is_correct": true
        },
        {
          "statement": "SAP Data Intelligence pour l'intégration et l'orchestration des données",
          "is_correct": true
        }
      ],
      "explanation": "Pour prendre en charge l'analyse en temps réel et l'apprentissage automatique dans SAP BTP, l'architecture doit inclure des composants qui gèrent le traitement des données, l'orchestration et l'exécution de modèles d'IA. SAP AI Core est conçu pour la gestion et l'exécution de flux de travail de machine learning, ce qui le rend idéal pour les fonctionnalités de ML. SAP HANA Cloud fournit le traitement des données en mémoire et l'analyse en temps réel, ce qui est essentiel pour gérer efficacement de grands volumes de données. SAP Data Intelligence permet l'intégration et l'orchestration des données à partir de sources hétérogènes, garantissant ainsi un flux de données sans faille. SAP S/4HANA est principalement destiné au traitement transactionnel et n'est pas optimisé pour le ML ou l'analytique. SAP Fiori est une technologie d'interface utilisateur et ne contribue pas directement à l'analytique ou au ML. Mnémonique : 'AI Core pour le ML', 'HANA Cloud pour le temps réel', 'Data Intelligence pour l'orchestration'.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-business-technology-platform/artificial-intelligence",
        "https://learning.sap.com/learning-journeys/explore-sap-hana-cloud",
        "https://learning.sap.com/learning-journeys/integrate-data-with-sap-data-intelligence-cloud"
      ]
    },
    {
      "id": 33,
      "statement": "Que prend en charge l'architecture de référence pour SAP Build Process Automation ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Intégration matérielle uniquement.",
          "is_correct": false
        },
        {
          "statement": "Intégration et extension de solutions SAP et non-SAP dans des environnements cloud et hybrides.",
          "is_correct": true
        },
        {
          "statement": "Uniquement des solutions sur site.",
          "is_correct": false
        },
        {
          "statement": "Configuration manuelle du processus.",
          "is_correct": false
        }
      ],
      "explanation": "SAP Build Process Automation prend en charge l'intégration et l'extension de solutions SAP et non-SAP dans des environnements cloud et hybrides. Son architecture de référence est conçue pour permettre l'automatisation des processus métier avec ou sans code, ce qui permet aux organisations de rationaliser les opérations sur divers systèmes. Il ne se limite pas à l'intégration matérielle ou aux solutions sur site. La configuration manuelle des processus est en contradiction avec le principe d'automatisation de SAP Build. A retenir : 'Construire = Automatiser + Intégrer + Étendre'.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-build-process-automation",
        "https://learning.sap.com/learning-journeys/automate-business-processes-with-sap-build-process-automation"
      ]
    },
    {
      "id": 34,
      "statement": "Une entreprise utilise SAP BTP pour développer une suite d'applications interconnectées. Ils doivent s'assurer que les données circulent de manière transparente entre les applications tout en restant conformes aux réglementations mondiales en matière de confidentialité des données. Que faut-il inclure dans l'architecture de la solution ?",
      "guidelines": "Il y a 3 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Tirez parti de SAP Data Custodian pour surveiller l'accès aux données et la conformité",
          "is_correct": true
        },
        {
          "statement": "Développer des solutions de chiffrement de données personnalisées pour chaque application",
          "is_correct": false
        },
        {
          "statement": "Utilisez une architecture décentralisée pour gérer les données dans chaque région séparément",
          "is_correct": false
        },
        {
          "statement": "Mettre en œuvre des contrôles de résidence des données à l'aide de SAP BTP'",
          "is_correct": true
        },
        {
          "statement": "Utilisez SAP Integration Suite pour un transfert de données sécurisé entre applications",
          "is_correct": true
        }
      ],
      "explanation": "Pour garantir un flux de données transparent et une conformité dans les applications SAP BTP, l'architecture doit inclure un dépositaire de données SAP pour surveiller l'accès aux données et appliquer les politiques de conformité. Les services de conformité de SAP BTP offrent des contrôles de résidence des données, garantissant que les données sont stockées et traitées conformément aux réglementations régionales. SAP Integration Suite facilite le transfert de données sécurisé et fiable entre les applications. Le développement d'un chiffrement personnalisé pour chaque application est inefficace et sujet aux erreurs. L'architecture décentralisée peut compliquer la conformité et la gouvernance des données. Mnémonique : 'Dépositaire de la conformité', 'Résidence pour la réglementation', 'Suite d'intégration pour un flux sécurisé'.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-data-custodian",
        "https://learning.sap.com/learning-journeys/integrate-applications-using-sap-integration-suite"
      ]
    },
    {
      "id": 35,
      "statement": "Quel est l'objectif principal du principe Clean Core de SAP au sein de SAP BTP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Pour permettre une intégration directe entre différents systèmes SAP sans middleware",
          "is_correct": false
        },
        {
          "statement": "Pour standardiser les modèles de données dans toutes les applications SAP",
          "is_correct": false
        },
        {
          "statement": "Pour s'assurer que toutes les personnalisations sont effectuées dans le système ERP de base",
          "is_correct": false
        },
        {
          "statement": "Pour minimiser les modifications dans le système ERP de base en créant des extensions en dehors du noyau à l'aide de SAP BTP",
          "is_correct": true
        }
      ],
      "explanation": "Le principe Clean Core de SAP vise à minimiser les modifications dans le système ERP de base en encourageant le développement d'extensions en dehors du noyau à l'aide de SAP BTP. Cette approche garantit des mises à niveau plus faciles, une meilleure maintenabilité et un alignement avec la stratégie cloud de SAP. Il ne favorise pas l'intégration directe sans middleware, ni n'impose la standardisation des modèles de données dans toutes les applications. Les personnalisations au sein du système ERP de base sont déconseillées afin de maintenir l'intégrité du système. Mnémonique : 'Clean Core = Garder l'ERP propre, étendre via BTP'.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-business-technology-platform/clean-core",
        "https://learning.sap.com/learning-journeys/extend-sap-s-4hana-with-sap-btp"
      ]
    },
    {
      "id": 36,
      "statement": "Vous avez été embauché en tant qu'architecte de solutions et c'est votre premier jour de travail. Vous participez à une réunion discutant de l'extension à SAP S//4HANA Cloud. Lors de la réunion, on vous dit : 'Nous avons déterminé que l'API BusinessPartner (A2X) dans SAP S/4HANA Cloud est insuffisante pour nos besoins. Extensibilité privilégiée pour l'utilisateur. Nous sommes en train de créer un schéma avec les briques techniques de l'extension '. Dans quelle phase de la méthodologie d'extension d'application SAP se trouve le projet ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Évaluer le cas d'utilisation de l'extension",
          "is_correct": false
        },
        {
          "statement": "Évaluer la technologie de vulgarisation",
          "is_correct": false
        },
        {
          "statement": "Définir la solution cible de l'extension",
          "is_correct": true
        }
      ],
      "explanation": "La phase mentionnée dans la question correspond à la phase 'Define Extension Target Solution'de la méthodologie d'extension d'application SAP. Cette phase intervient après l'identification du besoin d'extension et l'évaluation des technologies disponibles. Il s'agit de définir les briques techniques nécessaires à la solution cible, telles que les API, les services, les composants de l'interface utilisateur, etc. Le fait que l'équipe soit en train de créer un schéma technique indique qu'elle est en train de formaliser l'architecture de l'extension. Les autres réponses sont incorrectes : 'Évaluer le cas d'utilisation de l'extension 'est la phase initiale où les besoins de l'entreprise sont identifiés, et 'Évaluer la technologie de l'extension 'consiste à évaluer les technologies disponibles pour répondre à ces besoins. Astuce : Pour mémoriser les phases, utilisez l'acronyme A-E-D-D (Assess Use Case → Assess Technology → Define Solution → Develop Extension).",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/develop-side-by-side-extensions-on-sap-btp/extend-sap-s-4hana-cloud-applications_ea9b6b1e-3f9b-4e3e-9e2e-3e9f2a6e6a8e",
        "https://help.sap.com/docs/btp/sap-extension-suite-overview/application-extension-methodology"
      ]
    },
    {
      "id": 37,
      "statement": "Un fabricant souhaite discuter de la conception d'une solution qui suit et gère la disponibilité des stocks et les mouvements de go afin de s'assurer que les mouvements sont agrégés à des fins de reporting et que ces rapports peuvent être utilisés pour optimiser les stocks dans les solutions les plus récentes pour construire ces rapports. Lesquelles des solutions suivantes peuvent être utilisées ensemble pour répondre aux exigences ?",
      "guidelines": "Il y a 3 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP HANA Cloud",
          "is_correct": true
        },
        {
          "statement": "SAP Data Intelligence",
          "is_correct": false
        },
        {
          "statement": "SAP Analytics Cloud",
          "is_correct": true
        },
        {
          "statement": "Service SAP HANA (Régions SAP) pour SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Datasphère SAP",
          "is_correct": true
        }
      ],
      "explanation": "Pour répondre aux exigences de suivi des stocks, d'agrégation des mouvements et de génération de rapports optimisés, les solutions SAP recommandées sont : SAP HANA Cloud, SAP Analytics Cloud et SAP Datasphere. SAP HANA Cloud permet le stockage et le traitement en temps réel des données transactionnelles. SAP Datasphere facilite l'intégration et l'harmonisation des données provenant de différentes sources. SAP Analytics Cloud permet la visualisation et l'analyse de données agrégées. SAP Data Intelligence est mieux adapté à l'orchestration complexe des pipelines de données, mais est moins pertinent ici pour le reporting opérationnel. Le service SAP HANA (SAP Regions) est une infrastructure technique, qui n'est pas directement liée à la génération de rapports. Astuce : associez HANA Cloud au stockage, Datasphere à l'intégration et Analytics Cloud à la visualisation.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/explore-sap-datasphere/sap-datasphere-overview_3b3e2f3e-6f3e-4e3e-9e3e-3e3e3e3e3e3e",
        "https://help.sap.com/docs/hana-cloud/sap-hana-cloud-overview",
        "https://help.sap.com/docs/analytics-cloud/sap-analytics-cloud-overview"
      ]
    },
    {
      "id": 38,
      "statement": "Une organisation prévoit de migrer ses applications héritées vers SAP BTP en mettant l'accent sur la garantie d'une interruption minimale pendant la migration. Ils souhaitent adopter progressivement les technologies cloud tout en conservant leur infrastructure existante. Quelles stratégies migratoires doivent-ils envisager ?",
      "guidelines": "Il y a 3 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Déploiement hybride combinant solutions cloud et on-premise",
          "is_correct": true
        },
        {
          "statement": "Mise en œuvre de friches industrielles avec conversion du système et migration des données",
          "is_correct": true
        },
        {
          "statement": "Mise en œuvre Greenfield avec réingénierie complète des processus commerciaux",
          "is_correct": false
        },
        {
          "statement": "Approche lift-and-shift avec des modifications minimales des applications existantes",
          "is_correct": false
        },
        {
          "statement": "Mise en œuvre côte à côte avec migration progressive des processus d'entreprise",
          "is_correct": true
        }
      ],
      "explanation": "Pour une migration progressive vers SAP BTP avec un minimum de perturbations, les stratégies recommandées sont : le déploiement hybride, la conversion de friches industrielles et l'approche côte à côte. Le déploiement hybride vous permet de combiner des systèmes existants avec des solutions cloud. La conversion Brownfield préserve les processus existants lors de la migration des données vers SAP BTP. L'approche côte à côte permet de développer de nouvelles fonctionnalités cloud tout en maintenant les systèmes existants actifs. L'approche Greenfield implique une réingénierie complète, ce qui est contraire à l'objectif de minimiser les perturbations. Le lift-and-shift est trop limité pour tirer pleinement parti des capacités de SAP BTP. Astuce : Pour une transition en douceur, privilégiez les approches qui conservent les systèmes existants tout en introduisant le cloud.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/move-to-sap-btp/sap-btp-migration-strategies_2a2b2c2d-2e2f-3031-3233-343536373839",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/migration-strategies"
      ]
    },
    {
      "id": 39,
      "statement": "Quels scénarios sont les mieux adaptés à l'utilisation du modèle de programmation d'applications cloud (CAP) de SAP au sein de SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Création d'extensions pour SAP S/4HANA",
          "is_correct": true
        },
        {
          "statement": "Développement d'applications SaaS multi-tenants",
          "is_correct": true
        },
        {
          "statement": "Mettre en œuvre des analyses en temps réel",
          "is_correct": false
        },
        {
          "statement": "Construire des applications alimentées par l'IA",
          "is_correct": false
        }
      ],
      "explanation": "Le modèle de programmation d'applications cloud (CAP) de SAP est particulièrement adapté à la création d'extensions de SAP S/4HANA et au développement d'applications SaaS multi-tenants. CAP fournit un cadre de développement basé sur des modèles de données, des services OData et une intégration native avec SAP BTP. Il est conçu pour les applications cloud évolutives. Il n'est pas optimisé pour l'analyse en temps réel (qui est gérée par SAP HANA Cloud ou SAP Analytics Cloud) ni pour les applications alimentées par l'IA (qui sont gérées par SAP AI Core). Astuce : CAP = Cloud + Extensions + SaaS.",
      "Source_URL": [
        "https://cap.cloud.sap/docs/",
        "https://learning.sap.com/learning-journeys/develop-applications-using-sap-cloud-application-programming-model"
      ]
    },
    {
      "id": 40,
      "statement": "Quel outil est utilisé pour modéliser les capacités métier dans SAP Enterprise Architecture ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Concepteur d'architecture d'entreprise.",
          "is_correct": true
        },
        {
          "statement": "Logiciel de gestion de projet.",
          "is_correct": false
        },
        {
          "statement": "Outil d'automatisation du marketing.",
          "is_correct": false
        },
        {
          "statement": "Système de gestion des ressources humaines.",
          "is_correct": false
        }
      ],
      "explanation": "L'outil utilisé pour modéliser les capacités métier dans SAP Enterprise Architecture est l'Enterprise Architecture Designer (EAD). Il permet de visualiser les relations entre les processus, les applications, les données et les technologies. EAD est intégré à SAP Signavio et SAP BTP. Les autres outils cités (gestion de projet, marketing, RH) ne sont pas conçus pour la modélisation d'architecture d'entreprise. Astuce : EAD = Enterprise Architecture Designer = l'outil de cartographie stratégique de SAP.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/architect-enterprise-solutions-on-sap-btp/model-enterprise-architecture-with-sap-enterprise-architecture-designer_2f2f2f2f-2f2f-2f2f-2f2f-2f2f2f2f2f2f",
        "https://help.sap.com/docs/enterprise-architecture-designer"
      ]
    },
    {
      "id": 41,
      "statement": "Le service commercial d'un client a des problèmes avec les autorités gouvernementales qui s'occupent de la transparence autour de loggie et d'autres sujets de conformité. En tant qu'architecte de solutions SAP, quel service SAP BTP recommanderiez-vous pour être en conformité avec la réglementation ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Service de gestion du cloud SAP pour SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Service de journalisation SAP Cloud",
          "is_correct": false
        },
        {
          "statement": "Service de journal d'audit SAP",
          "is_correct": true
        },
        {
          "statement": "Service de journalisation des applications SAP pour SAP BTP",
          "is_correct": false
        }
      ],
      "explanation": "La bonne réponse est le service SAP Audit Log. Ce service est conçu pour assurer la traçabilité des événements critiques dans SAP BTP, y compris les accès, les modifications de configuration et les actions sensibles. Il est essentiel pour répondre aux exigences réglementaires en matière de transparence, de conformité et d'auditabilité. Contrairement au service SAP Cloud Logging, qui est plus généraliste et axé sur le débogage technique, SAP Audit Log est spécifiquement destiné aux audits réglementaires. Les services SAP Cloud Management et SAP Application Logging n'offrent pas les garanties de sécurité et de conformité exigées par les autorités. Astuce : associez 'Journal d'Audit' à 'réglementation' et 'conformité' pour vous souvenir de son rôle.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-audit-log-service",
        "https://learning.sap.com/learning-journey/developing-with-sap-extension-suite"
      ]
    },
    {
      "id": 42,
      "statement": "Quelle est la responsabilité première d'un architecte d'entreprise ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Aligner la stratégie informatique sur les objectifs commerciaux.",
          "is_correct": true
        },
        {
          "statement": "Développer des solutions spécifiques pour des exigences complexes.",
          "is_correct": false
        },
        {
          "statement": "Planifier et développer des projets logiciels.",
          "is_correct": false
        },
        {
          "statement": "Gestion des politiques de sécurité informatique.",
          "is_correct": false
        }
      ],
      "explanation": "La principale responsabilité d'un architecte d'entreprise est d'aligner la stratégie informatique sur les objectifs de l'entreprise. Cela implique de concevoir une architecture cohérente, évolutive et sécurisée qui prend en charge les processus métier. D'autres rôles sont plus spécialisés : les architectes de solutions se concentrent sur le développement de solutions complexes, les chefs de projet gèrent la planification et les responsables de la sécurité informatique supervisent les politiques de sécurité. Conseil : n'oubliez pas que l'architecte d'entreprise fait le lien entre la stratégie d'entreprise et l'architecture informatique.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/architecting-solutions-on-sap-business-technology-platform",
        "https://help.sap.com/docs/btp/sap-enterprise-architecture-designer"
      ]
    },
    {
      "id": 43,
      "statement": "Quels sont les cinq aspects clés de la stratégie d'intégration de SAP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Approche de la plateforme, évolutivité limitée, intégration manuelle, gestion statique du cycle de vie, reporting de base",
          "is_correct": false
        },
        {
          "statement": "Solutions personnalisées, processus isolés, intégration manuelle, gestion statique du cycle de vie, rapports de base",
          "is_correct": false
        },
        {
          "statement": "Plateforme de base, agilité limitée, fragmentation de l'intégration, gestion statique du cycle de vie, pas d'analyse",
          "is_correct": false
        },
        {
          "statement": "Approche plateforme, agilité, démocratisation de l'intégration, gestion intelligente du cycle de vie, analytique",
          "is_correct": true
        }
      ],
      "explication ": "La stratégie d'intégration de SAP repose sur cinq piliers : l'approche plateforme, l'agilité, la démocratisation de l'intégration, la gestion intelligente du cycle de vie et l'analytique. Ces éléments permettent une intégration transparente entre les systèmes SAP et non-SAP, garantissant ainsi l'évolutivité et la gouvernance. Les autres options décrivent des approches désuètes ou ne sont pas alignées avec la vision de SAP. Astuce : n'oubliez pas l'acronyme PAIGA (Platform, Agility, Integration democratization, Governance, Analytics).",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/integrating-and-extending-sap-applications",
        "https://help.sap.com/docs/btp/sap-integration-suite"
      ]
    },
    {
      "id": 44,
      "statement": "Quel est l'avantage significatif de l'extensibilité pour les développeurs ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Fournit des analyses commerciales prêtes à l'emploi au sein du noyau propre",
          "is_correct": false
        },
        {
          "statement": "Améliore les fonctionnalités de sécurité intégrées au sein du noyau propre",
          "is_correct": false
        },
        {
          "statement": "Permet un codage personnalisé étendu tout en maintenant le noyau propre",
          "is_correct": true
        },
        {
          "statement": "Simplifie la gestion du stockage dans le cloud pour garder le cœur propre",
          "is_correct": false
        }
      ],
      "explanation": "L'extensibilité pour les développeurs permet aux développeurs de créer des extensions personnalisées tout en adhérant au principe Clean Core. Cela signifie que le code personnalisé est isolé du cœur de l'ERP, ce qui facilite les mises à jour et la maintenance. Les autres réponses ne reflètent pas les principaux avantages de cette approche. Astuce : associez l'extensibilité du développeur à du 'code personnalisé en dehors du noyau'pour préserver la stabilité du système.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/developing-side-by-side-extensions-on-sap-btp",
        "https://help.sap.com/docs/btp/sap-clean-core"
      ]
    },
    {
      "id": 45,
      "statement": "Quel est l'aspect crucial de la gestion de la connectivité dans SAP BTP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Désactivation de la surveillance du réseau.",
          "is_correct": false
        },
        {
          "statement": "Gestion sécurisée des API.",
          "is_correct": true
        },
        {
          "statement": "Limitation des points de connexion.",
          "is_correct": false
        },
        {
          "statement": "Réduire la bande passante du réseau.",
          "is_correct": false
        }
      ],
      "explanation": "La gestion sécurisée des API est un aspect crucial de la connectivité dans SAP BTP. Il permet le contrôle d'accès, la surveillance des appels API et la protection des données échangées entre les systèmes. La réduction de la bande passante ou la limitation des points de connexion ne garantit pas la sécurité. La surveillance du réseau est utile, mais ne remplace pas une gestion robuste des API. Astuce : n'oubliez pas que la gestion des API est le gardien des échanges inter-applications dans SAP BTP.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/integrating-and-extending-sap-applications",
        "https://help.sap.com/docs/btp/sap-api-management"
      ]
    },
    {
      "id": 46,
      "statement": "Quels frameworks fournissent la structure de l'architecture d'entreprise ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Gartner EA Framework",
          "is_correct": true
        },
        {
          "statement": "FEAF",
          "is_correct": true
        },
        {
          "statement": "CAP",
          "is_correct": false
        },
        {
          "statement": "RAP",
          "is_correct": false
        },
        {
          "statement": "CPEA",
          "is_correct": false
        }
      ],
      "explanation": "Les bonnes réponses sont 'SAP AppGyver' et 'SAP Build Apps'. Il s'agit de plates-formes de développement low-code/no-code proposées par SAP pour la création d'applications avec un effort de programmation minimal. SAP AppGyver est conçu pour les développeurs citoyens et permet le prototypage et le déploiement rapides d'applications mobiles et Web à l'aide de la programmation visuelle. SAP Build Apps fait partie de la suite SAP Build, qui intègre les capacités d'AppGyver et fournit des fonctionnalités améliorées de niveau entreprise pour les développeurs professionnels et les utilisateurs professionnels.\n\nOptions incorrectes :\n- 'SAP Fiori Elements' est un framework d'interface utilisateur pour la création d'applications SAP Fiori à l'aide d'annotations, et non d'une plate-forme low-code.\n- 'SAP Business Application Studio' est un environnement de développement à part entière pour le codage professionnel,  not low-code.\n\n💡 Astuce : Pour retenir les outils low-code SAP, pensez à 'Build' = 'Construire sans coder'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/develop-applications-using-sap-build-apps",
        "https://help.sap.com/docs/appgyver"
      ]
    },
    {
      "id": 47,
      "statement": "Quel service SAP BTP est conçu pour développer des applications d'entreprise à l'aide d'outils low-code/no-code ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Suite d'extension SAP",
          "is_correct": false
        },
        {
          "statement": "Éléments SAP Fiori",
          "is_correct": false
        },
        {
          "statement": "SAP AppGyver",
          "is_correct": true
        },
        {
          "statement": "SAP Business Application Studio",
          "is_correct": false
        }
      ],
      "explanation": "Les bonnes réponses sont 'SAP Analytics Cloud' et 'SAP Datasphere'. SAP Analytics Cloud (SAC) est la solution unifiée de SAP pour l'informatique décisionnelle, la planification et l'analyse prédictive. Il permet la visualisation des données et la prise de décision en temps réel. SAP Datasphere est l'évolution de SAP Data Warehouse Cloud, fournissant une structure de données unifiée pour harmoniser les données entre les sources.\n\nOptions incorrectes :\n- 'SAP AppGyver' est un outil de développement low-code et n'est pas conçu pour l'analyse.\n- 'SAP Build Work Zone' est utilisé pour créer des expériences de lieu de travail numérique, pas des analyses.\n\n💡 Astuce : Associez 'Analytics Cloud' à 'visualisation' et 'Datasphere' à 'harmonisation des données'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/explore-sap-analytics-cloud",
        "https://learning.sap.com/learning-journeys/explore-sap-datasphere"
      ]
    },
    {
      "id": 48,
      "statement": "Laquelle des étapes suivantes est une étape essentielle dans la création de plans d'architecture pour l'intégration ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Se concentrer uniquement sur les besoins à court terme",
          "is_correct": false
        },
        {
          "statement": "Exclure les parties prenantes du processus de planification",
          "is_correct": false
        },
        {
          "statement": "Ne pas tenir compte des problèmes de sécurité de l'intégration",
          "is_correct": false
        },
        {
          "statement": "Documenter les architectures d'état actuelles et futures",
          "is_correct": true
        },
        {
          "statement": "Ignorer l'infrastructure informatique existante",
          "is_correct": false
        }
      ],
      "explanation": "La bonne réponse est 'SAP AI Foundation'. Ce service fournit les composants de base pour la création et le déploiement de modèles d'IA au sein de SAP BTP. Il comprend des outils pour la gestion du cycle de vie, la connectivité des données et l'intégration avec les applications SAP.\n\nOptions incorrectes :\n- 'SAP Build Work Zone' est destiné à la création de portails de lieu de travail numériques.\n- 'SAP AppGyver' est un outil de développement low-code.\n- 'SAP Analytics Cloud' est destiné à l'analyse et à la planification, pas à la gestion du cycle de vie de l'IA.\n\n💡 Astuce : 'AI Foundation' = 'Fondation pour l'IA',  donc gestion du cycle de vie des modèles IA.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/explore-sap-ai-core-and-sap-ai-foundation",
        "https://help.sap.com/docs/ai-foundation"
      ]
    },
    {
      "id": 49,
      "statement": "Quelles sont les principales fonctionnalités offertes par SAP AI Foundation sur SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Services d'IA prédéfinis pour des cas d'utilisation métier spécifiques",
          "is_correct": true
        },
        {
          "statement": "Prise en charge de la gestion des données de référence dans les applications SAP",
          "is_correct": false
        },
        {
          "statement": "Intégration avec SAP Data Intelligence pour la préparation des données",
          "is_correct": false
        },
        {
          "statement": "Outils pour construire et déployer des modèles d'apprentissage automatique",
          "is_correct": true
        }
      ],
      "explanation": "Les réponses correctes sont 'SAP Build Work Zone' et 'SAP Build Apps'. SAP Build Work Zone permet de créer des expériences d'espace de travail numérique en intégrant des applications, du contenu et des processus dans une interface unifiée. SAP Build Apps permet aux utilisateurs de créer des applications qui peuvent être intégrées dans les environnements Work Zone.\n\nOptions incorrectes :\n- 'SAP Datasphere' est destiné à la gestion des données et non aux interfaces numériques de l'espace de travail.\n- 'SAP AI Core' est destiné à l'exécution de modèles d'IA et non à l'intégration de l'interface utilisateur ou du lieu de travail.\n\n💡 Astuce : 'Work Zone' = 'Zone de travail numérique',  'Build Apps' = 'Applications intégrables'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/create-digital-experiences-with-sap-build-work-zone",
        "https://learning.sap.com/learning-journeys/develop-applications-using-sap-build-apps"
      ]
    },
    {
      "id": 50,
      "statement": "Quel outil est conçu pour la business intelligence, la planification et l'analyse prédictive ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Datasphère SAP",
          "is_correct": false
        },
        {
          "statement": "SAP Analytics Cloud",
          "is_correct": true
        },
        {
          "statement": "Gouvernance des données de référence SAP",
          "is_correct": false
        },
        {
          "statement": "SAP HANA Cloud",
          "is_correct": false
        }
      ],
      "explication": "",
      "Source_URL": []
    },
    {
      "id": 51,
      "statement": "Quelles sont les activités de la phase 'Évaluez votre stratégie d'intégration' du Mécanisme de conseil en solutions d'intégration SAP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Pour couvrir de nouveaux modèles d'intégration",
          "is_correct": false
        },
        {
          "statement": "Pour définir et introduire des rôles d'intégration",
          "is_correct": true
        },
        {
          "statement": "Pour déployer des plans d'architecture de solution",
          "is_correct": false
        },
        {
          "statement": "Pour simplifier les paysages après les fusions et acquisitions",
          "is_correct": true
        }
      ],
      "explanation": "Dans la phase 'Évaluez votre stratégie d'intégration'de la SAP ISA-M (Integration Solution Advisory Methodology), l'objectif est d'établir une compréhension claire de l'état actuel de l'intégration au sein de l'organisation. Deux activités clés sont les suivantes : 1) Définir et introduire les rôles d'intégration, ce qui clarifie les responsabilités entre les architectes, les développeurs et les parties prenantes de l'entreprise. 2) Simplifier les paysages après les fusions ou acquisitions, pour réduire la complexité et les redondances dans les systèmes. Ces activités n'impliquent pas directement le déploiement de plans ou la couverture de nouveaux modèles, mais jettent les bases d'une stratégie cohérente. Astuce : associez cette phase à l'analyse organisationnelle et à la rationalisation post-acquisition. Il prépare les phases suivantes, telles que la définition des modèles et des plans.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/implementing-sap-integration-suite",
        "https://help.sap.com/docs/SAP_INTEGRATION_SUITE/isa-m-methodology"
      ]
    },
    {
      "id": 52,
      "statement": "Quels sont les avantages d'utiliser des flux d'intégration générés par l'IA et des scripts Groovy dans les processus d'intégration ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Ils se concentrent principalement sur la gestion des médias sociaux.",
          "is_correct": false
        },
        {
          "statement": "Ils améliorent l'efficacité des processus, rationalisent les intégrations et réduisent les erreurs de codage manuel.",
          "is_correct": true
        },
        {
          "statement": "Ils simplifient le processus de création de contenu marketing.",
          "is_correct": false
        },
        {
          "statement": "Ils augmentent la charge de travail des employés existants.",
          "is_correct": false
        }
      ],
      "explanation": "L'utilisation de flux d'intégration générés par l'IA et de scripts Groovy dans SAP Integration Suite améliore considérablement l'efficacité des processus. Ces outils automatisent la création de scénarios d'intégration, réduisent les erreurs humaines associées au codage manuel et accélèrent le déploiement. Contrairement aux réponses incorrectes, ces technologies ne sont pas destinées à la gestion des médias sociaux ou à la création de contenu marketing. Astuce : n'oubliez pas que l'IA dans SAP Integration Suite est conçue pour optimiser les tâches techniques répétitives, en particulier dans les scripts et les mappages.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/developing-integrations-with-sap-integration-suite",
        "https://help.sap.com/docs/SAP_INTEGRATION_SUITE"
      ]
    },
    {
      "id": 53,
      "statement": "Quel est l'élément clé dans la promotion d'une culture d'appropriation et d'engagement au sein d'une organisation ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Centraliser tous les processus de décision",
          "is_correct": false
        },
        {
          "statement": "Se concentrer uniquement sur des objectifs à court terme",
          "is_correct": false
        },
        {
          "statement": "Réduire les canaux de communication pour éviter toute confusion",
          "is_correct": false
        },
        {
          "statement": "Encourager la responsabilisation individuelle et la collaboration d'équipe",
          "is_correct": true
        },
        {
          "statement": "Limiter l'accès aux outils d'intégration à la direction générale",
          "is_correct": false
        }
      ],
      "explanation": "La promotion d'une culture d'appropriation et d'engagement repose sur l'encouragement de la responsabilisation individuelle et de la collaboration d'équipe. Cela favorise l'innovation, la transparence et l'efficacité. En revanche, centraliser les décisions ou limiter la communication entrave l'engagement. SAP préconise des pratiques de gouvernance participative dans ses méthodologies d'architecture d'entreprise. Conseil : associez l'engagement à la responsabilité et à la transparence, qui sont les piliers d'une transformation réussie.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/becoming-an-sap-enterprise-architect",
        "https://help.sap.com/docs/SAP_ENTERPRISE_ARCHITECTURE_DESIGNER"
      ]
    },
    {
      "id": 54,
      "statement": "Le service financier est en train de créer une série de rapports pour ses utilisateurs de secteur d'activité (LOB) et aimerait intégrer le . Ils souhaitent que les utilisateurs du secteur d'activité gèrent le portail, et non le service informatique. En tant qu'architecte de solutions, ils viennent à vous pour enregistrer les meilleures réponses à leurs besoins. Quel service recommanderiez-vous ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Zone de travail SAP Build, édition avancée",
          "is_correct": true
        },
        {
          "statement": "SAP Fiori Launchpad",
          "is_correct": false
        },
        {
          "statement": "Zone de travail SAP Build, édition standard",
          "is_correct": false
        },
        {
          "statement": "Service SAP Launchpad",
          "is_correct": false
        }
      ],
      "explanation": "SAP Build Work Zone, édition avancée est conçu pour permettre aux utilisateurs professionnels (LOB) de créer et de gérer des portails sans dépendre de l'informatique. Il offre des capacités avancées de personnalisation, d'intégration de contenu et de collaboration. D'autres options telles que SAP Fiori Launchpad ou SAP Launchpad Service sont plus techniques et orientées vers les développeurs ou les administrateurs. Astuce : associez 'advanced edition' à l'autonomie des utilisateurs métiers dans la gestion des interfaces.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/extending-sap-applications-with-sap-build-work-zone",
        "https://help.sap.com/docs/SAP_BUILD_WORK_ZONE"
      ]
    },
    {
      "id": 55,
      "statement": "Quel est l'objectif principal de l'architecture de la data fabric ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Fournir un support client et une gestion de la relation",
          "is_correct": false
        },
        {
          "statement": "Centraliser, lier, gérer et contrôler les données de divers systèmes et applications",
          "is_correct": true
        },
        {
          "statement": "Développer et déployer des applications mobiles",
          "is_correct": false
        },
        {
          "statement": "Simplifiez l'interface utilisateur pour les applications de données",
          "is_correct": false
        }
      ],
      "explanation": "L'architecture de la Data Fabric vise à centraliser, lier, gérer et contrôler les données de plusieurs systèmes et applications. Il permet une gouvernance unifiée, une meilleure qualité des données et une accessibilité accrue pour les analyses. Contrairement aux autres options, il n'aborde pas directement la gestion des clients ou le développement d'applications mobiles. Conseil : N'oubliez pas que la Data Fabric est l'épine dorsale de la gestion intelligente des données dans SAP BTP.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/implementing-data-fabric-with-sap-datasphere",
        "https://help.sap.com/docs/SAP_DATASPHERE"
      ]
    },
    {
      "id": 56,
      "statement": "Quel est l'objectif de mettre en place une gouvernance d'intégration dans une organisation ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Pour réduire le nombre d'outils d'intégration utilisés",
          "is_correct": false
        },
        {
          "statement": "Pour établir des normes et en assurer la conformité",
          "is_correct": true
        },
        {
          "statement": "Centraliser la prise de décision entre les mains d'une seule entité",
          "is_correct": false
        },
        {
          "statement": "Pour limiter la flexibilité des processus d'intégration",
          "is_correct": false
        },
        {
          "statement": "Pour diminuer l'implication des parties prenantes",
          "is_correct": false
        }
      ],
      "explanation": "L'introduction de la gouvernance d'intégration dans une organisation a pour objectif essentiel d'établir des normes et d'assurer la conformité des processus d'intégration. La gouvernance fournit un cadre structuré qui définit les rôles, les responsabilités et les politiques de gestion des intégrations, ce qui est essentiel dans des environnements complexes impliquant plusieurs systèmes et parties prenantes. En l'absence de gouvernance, les efforts d'intégration peuvent devenir fragmentés, ce qui entraîne des risques de sécurité, des flux de données incohérents et la non-conformité aux exigences réglementaires. Des options incorrectes telles que la réduction des outils ou la centralisation des décisions simplifient trop le défi et peuvent entraver l'agilité. La gouvernance ne vise pas à limiter la flexibilité, mais plutôt à l'équilibrer avec le contrôle. Pour s'en souvenir, associez la gouvernance à des 'garde-fous ': elle guide l'intégration sans restreindre l'innovation. SAP recommande d'utiliser la méthodologie de conseil en matière de solutions d'intégration SAP (ISA-M) pour définir des modèles de gouvernance adaptés aux besoins organisationnels.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/integrate-your-sap-solutions-using-sap-integration-suite/introducing-integration-governance_LG_3b9f9e5d-3e5e-4d3e-9c3a-2a9f9e5d3e5e",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/integration-governance"
      ]
    },
    {
      "id": 57,
      "statement": "Combien de solutions le catalogue de build SAP contient-il pour diverses applications SAP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Moins de 50 solutions.",
          "is_correct": false
        },
        {
          "statement": "Exactement 100 solutions.",
          "is_correct": false
        },
        {
          "statement": "Plus de 500 solutions prêtes à l'emploi.",
          "is_correct": true
        },
        {
          "statement": "Seulement 10 solutions.",
          "is_correct": false
        }
      ],
      "explanation": "Le catalogue de build SAP contient plus de 500 solutions prêtes à l'emploi conçues pour accélérer le développement et l'intégration dans les applications SAP. Ces solutions comprennent des modèles, des flux de travail et des composants d'interface utilisateur qui peuvent être réutilisés et personnalisés, ce qui réduit considérablement le temps de développement. Les options incorrectes sous-estiment l'échelle et la richesse du catalogue. SAP élargit continuellement ce catalogue pour prendre en charge divers scénarios commerciaux, en particulier dans les environnements low-code/no-code. Pour vous en souvenir, considérez SAP Build Catalog comme une 'place de marché de solutions ': grande, diversifiée et en pleine croissance. Il est accessible via SAP Build Work Zone et prend en charge les développeurs citoyens et les professionnels de l'informatique.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/develop-applications-using-sap-build-apps/explore-the-sap-build-catalog_LG_3b9f9e5d-3e5e-4d3e-9c3a-2a9f9e5d3e5e",
        "https://help.sap.com/docs/build-apps/sap-build-apps-overview/sap-build-catalog"
      ]
    },
    {
      "id": 58,
      "statement": "Quels sont les principaux composants de la présentation du modèle de méthodologie d'extension d'application SAP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Phase 2 : Évaluer la technologie de vulgarisation",
          "is_correct": true
        },
        {
          "statement": "Phase 1 : Évaluer le cas d'utilisation de l'extension",
          "is_correct": true
        },
        {
          "statement": "Phase 4 : Évaluer les tests d'intégration",
          "is_correct": false
        },
        {
          "statement": "Phase 5 : Évaluer la migration des données",
          "is_correct": false
        }
      ],
      "explanation": "La méthodologie d'extension des applications SAP est structurée en phases qui guident l'extension des applications SAP de manière propre et évolutive. La phase 1 (Évaluer le cas d'utilisation de l'extension) se concentre sur la compréhension du besoin de l'entreprise et sur la détermination de la nécessité d'une extension. La phase 2 (Évaluer la technologie d'extension) évalue les options techniques disponibles, telles que l'extensibilité dans l'application ou les extensions côte à côte à l'aide de SAP BTP. Les phases incorrectes telles que 'Évaluer les tests d'intégration 'ou 'Évaluer la migration des données 'ne font pas partie du modèle de méthodologie de base. Pour le retenir, retenez l'acronyme AEMT : Use Case → Technology → Target Solution → Implementation. Cette approche par étapes garantit l'alignement avec le principe Clean Core de SAP et soutient l'extensibilité durable.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/extend-sap-s-4hana-with-sap-business-technology-platform/understand-the-sap-application-extension-methodology_LG_3b9f9e5d-3e5e-4d3e-9c3a-2a9f9e5d3e5e",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/application-extension-methodology"
      ]
    },
    {
      "id": 59,
      "statement": "Quelle est une caractéristique clé du développement d'applications dans SAP BTP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Cadres de développement illimités",
          "is_correct": false
        },
        {
          "statement": "Intégration avec les outils DevOps",
          "is_correct": true
        },
        {
          "statement": "Mises à jour manuelles du code",
          "is_correct": false
        }
      ],
      "explanation": "Une caractéristique clé du développement d'applications dans SAP BTP est son intégration avec les outils DevOps. Cela permet une intégration et une livraison continues (CI/CD), des tests automatisés et des processus de déploiement rationalisés. SAP BTP prend en charge DevOps par le biais de services tels que SAP Continuous Integration and Delivery et l'intégration avec GitHub, Jenkins et d'autres outils. Des options incorrectes telles que les 'mises à jour manuelles du code 'contredisent les objectifs d'automatisation de DevOps. Pour vous en souvenir, associez SAP BTP à une 'plateforme prête pour DevOps', conçue pour l'agilité et l'évolutivité. Cette intégration accélère les cycles de développement et améliore la collaboration entre les équipes de développement et d'exploitation.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/develop-applications-on-sap-business-technology-platform/integrate-devops-tools-in-sap-btp_LG_3b9f9e5d-3e5e-4d3e-9c3a-2a9f9e5d3e5e",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/devops-integration"
      ]
    },
    {
      "id": 60,
      "statement": "Quels sont les éléments à prendre en compte lors du choix d'un modèle commercial pour une solution SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Respect des règles de résidence des données",
          "is_correct": false
        },
        {
          "statement": "Tarification basée sur l'utilisation vs. tarification basée sur l'abonnement",
          "is_correct": true
        },
        {
          "statement": "Intégration avec des systèmes sur site",
          "is_correct": false
        },
        {
          "statement": "Flexibilité dans la mise à l'échelle de la solution",
          "is_correct": true
        }
      ],
      "explanation": "Lors du choix d'un modèle commercial pour les solutions SAP BTP, deux considérations clés sont la structure tarifaire et l'évolutivité. SAP propose une tarification basée sur l'utilisation (paiement à l'utilisation) et une tarification par abonnement, permettant aux organisations de choisir en fonction du budget et des modèles d'utilisation. La flexibilité dans la mise à l'échelle est également cruciale, car les entreprises peuvent avoir besoin d'ajuster les ressources de manière dynamique. Les options incorrectes telles que la résidence des données ou l'intégration avec des systèmes sur site sont des considérations techniques ou de conformité, et non commerciales. Pour s'en souvenir, considérez les modèles commerciaux SAP BTP comme une 'facturation adaptative et une mise à l'échelle élastique '. La compréhension de ces modèles permet d'optimiser les coûts et les performances dans les déploiements cloud.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/explore-sap-business-technology-platform/select-a-commercial-model-for-sap-btp_LG_3b9f9e5d-3e5e-4d3e-9c3a-2a9f9e5d3e5e",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/commercial-models"
      ]
    },
    {
      "id": 61,
      "statement": "Une grande entreprise souhaite passer de son ancien système ERP à SAP S/4HANA sur SAP BTP. L'entreprise a des processus métier complexes et a besoin d'une stratégie qui minimise les perturbations tout en tirant parti des capacités du cloud. Quelle approche migratoire faut-il préconiser ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Approche Brownfield avec conversion du système",
          "is_correct": true
        },
        {
          "statement": "Approche hybride combinant Greenfield et Brownfield",
          "is_correct": false
        },
        {
          "statement": "Approche Greenfield avec réimplémentation complète",
          "is_correct": false
        },
        {
          "statement": "Outil de migration sur mesure sur SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Mise en œuvre côte à côte avec transition progressive",
          "is_correct": true
        }
      ],
      "explanation": "L'approche Brownfield avec conversion du système est idéale pour les entreprises qui souhaitent conserver leurs processus commerciaux existants lors de la transition vers SAP S/4HANA. Il permet une mise à niveau technique du système, en préservant les données historiques et les configurations. Cela minimise les perturbations et accélère le calendrier de migration. La mise en œuvre côte à côte avec transition progressive convient également aux environnements complexes. Il permet la coexistence de systèmes existants et nouveaux, ce qui permet l'adoption progressive des capacités de SAP BTP. Cette stratégie soutient l'innovation sans interrompre les opérations de base. L'approche Greenfield, bien qu'exhaustive, implique une réingénierie complète et n'est peut-être pas optimale pour minimiser les perturbations. Un outil de migration personnalisé n'est pas une stratégie standard recommandée par SAP et peut présenter des risques. À retenir : Brownfield = préserver et convertir ; Side-by-side = coexister et innover progressivement.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/migrate-your-sap-erp-system-to-sap-s-4hana",
        "https://help.sap.com/docs/SAP_S4HANA_CLOUD"
      ]
    },
    {
      "id": 62,
      "statement": "Quelle partie de l'architecture SAP Al est responsable de la gestion de la saisie de texte par les utilisateurs finaux ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Carrefour d'IA générative",
          "is_correct": false
        },
        {
          "statement": "SAP Al Core",
          "is_correct": false
        },
        {
          "statement": "SAP Joule",
          "is_correct": true
        },
        {
          "statement": "SAP Al Launchpad",
          "is_correct": false
        }
      ],
      "explanation": "SAP Joule est l'assistant d'IA générative intégré aux applications SAP, conçu pour interagir avec les utilisateurs par le biais du langage naturel. Il gère la saisie de texte par les utilisateurs finaux, interprète l'intention et fournit des réponses contextuelles. Joule s'intègre aux systèmes SAP pour fournir des informations et automatiser les tâches. SAP AI Core est responsable de la gestion des modèles et des flux de travail d'IA, mais ne gère pas directement les entrées utilisateur. Le hub d'IA générative orchestre les services d'IA, mais n'est pas la couche d'interface. SAP AI Launchpad est utilisé pour gérer le cycle de vie de l'IA, mais pas pour l'interaction avec l'utilisateur. Astuce : Joule = assistant IA orienté utilisateur ; Core = moteur d'IA backend.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/explore-generative-ai-in-sap-business-technology-platform",
        "https://help.sap.com/docs/SAP_JOULE"
      ]
    },
    {
      "id": 63,
      "statement": "Quels facteurs faut-il prendre en compte lors de la planification d'une stratégie DevOps pour des applications sur SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Intégration continue et livraison continue (CI/CD)",
          "is_correct": true
        },
        {
          "statement": "Évolutivité du pipeline DevOps",
          "is_correct": true
        },
        {
          "statement": "Conformité avec SAP BTP'",
          "is_correct": false
        },
        {
          "statement": "Intégration avec les outils DevOps sur site",
          "is_correct": false
        }
      ],
      "explanation": "L'intégration continue et la livraison continue (CI/CD) sont fondamentales pour les stratégies DevOps sur SAP BTP. Ils permettent des tests, une intégration et un déploiement automatisés, garantissant une livraison rapide et fiable des applications. L'évolutivité du pipeline DevOps garantit que le système peut gérer des charges de travail croissantes et s'adapter à l'évolution des besoins de l'entreprise. Ces facteurs améliorent l'agilité et réduisent le time-to-market. La conformité aux normes de sécurité de SAP BTP est importante, mais n'est pas un facteur de planification spécifique à DevOps. L'intégration avec des outils sur site peut être pertinente, mais elle est secondaire par rapport à la CI/CD et à l'évolutivité. Mnémologique : CI/CD = vitesse ; Évolutivité = croissance.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/develop-applications-on-sap-business-technology-platform",
        "https://help.sap.com/docs/BTP_DEVOPS"
      ]
    },
    {
      "id": 64,
      "statement": "Le service informatique d'un client possède une demi-douzaine de sous-comptes. Ils rencontrent des problèmes avec l'administration du compte global de sous-compte. Quel service SAP BTP recommanderiez-vous au client, pour concevoir et développer une application sur mesure à réaliser ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Service de gestion du cloud SAP pour SAP BTP",
          "is_correct": true
        },
        {
          "statement": "Service de journal d'audit SAP",
          "is_correct": false
        },
        {
          "statement": "Service de surveillance SAP pour SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Service de domaine personnalisé SAP",
          "is_correct": false
        }
      ],
      "explanation": "Le service de gestion du cloud SAP pour SAP BTP fournit des outils pour gérer les comptes globaux et les sous-comptes, y compris l'attribution de quotas, les droits et les abonnements aux services. Il est idéal pour concevoir et développer des applications personnalisées afin de rationaliser l'administration de plusieurs sous-comptes. Le service SAP Audit Log est axé sur la conformité et la journalisation, et non sur l'administration. Le service de surveillance SAP offre des fonctionnalités d'observabilité, mais pas de gestion. Le service SAP Custom Domain se charge du mappage de domaine, et non de l'administration des comptes. Astuce : Gestion du cloud = contrôle de l'administrateur ; Journal d'audit = conformité.",
      "Source_URL": [
        "https://help.sap.com/docs/BTP_ACCOUNT_MODEL",
        "https://learning.sap.com/learning-journey/manage-subaccounts-and-entitlements-in-sap-btp"
      ]
    },
    {
      "id": 65,
      "statement": "Quelle est la fonction principale de SAP Datasphere ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Améliorer la gestion de la relation client chez SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Intégrer et gérer des données provenant de sources diverses",
          "is_correct": true
        },
        {
          "statement": "Fournir des solutions de stockage cloud avec SAP HANA",
          "is_correct": false
        },
        {
          "statement": "Développer des applications mobiles avec des données personnalisées",
          "is_correct": false
        }
      ],
      "explanation": "SAP Datasphere est la solution de gestion de données unifiée de SAP qui intègre, gère et gouverne des données provenant de diverses sources. Il permet un accès en temps réel, une modélisation sémantique et un partage de données entre les systèmes. Cela prend en charge les cas d'utilisation de l'analytique, de l'apprentissage automatique et de la veille économique. Il n'est pas conçu pour le CRM, le stockage dans le cloud ou le développement d'applications mobiles. SAP HANA fournit le stockage et le traitement, mais Datasphere ajoute l'intégration et la gouvernance. Mnémonique : Datasphere = data fabric + gouvernance + intégration.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/explore-sap-datasphere",
        "https://help.sap.com/docs/SAP_DATASPHERE"
      ]
    },
    {
      "id": 66,
      "statement": "Quelle est une caractéristique clé de SAP Build Process Automation ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Nécessite des connaissances avancées en programmation.",
          "is_correct": false
        },
        {
          "statement": "Limité au déploiement sur site.",
          "is_correct": false
        },
        {
          "statement": "Saisie manuelle des données.",
          "is_correct": false
        },
        {
          "statement": "Interface graphique intuitive pour la création ou la personnalisation de processus.",
          "is_correct": true
        }
      ],
      "explanation": "SAP Build Process Automation est conçu pour simplifier la création et la personnalisation des processus métier sans nécessiter de compétences avancées en programmation. Sa principale caractéristique est l'interface graphique intuitive qui permet aux utilisateurs de modéliser les flux de travail, d'automatiser les tâches et de s'intégrer aux systèmes SAP et non SAP. Cette approche low-code/no-code permet aux utilisateurs professionnels et aux développeurs citoyens de participer à des initiatives d'automatisation des processus, réduisant ainsi la dépendance vis-à-vis des services informatiques. Les options incorrectes (saisie manuelle des données, limitation sur site et exigences de programmation avancées) ne reflètent pas les capacités de SAP Build Process Automation, qui est cloud-native et axée sur la facilité d'utilisation. Pour vous en souvenir, associez 'Build' à 'conception visuelle' et 'automatisation' à 'aucun effort manuel'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/automate-business-processes-with-sap-build-process-automation",
        "https://help.sap.com/docs/build-process-automation"
      ]
    },
    {
      "id": 67,
      "statement": "Un client a besoin d'un plan tarifaire pour le service SAP Integration Suite avec facturation mensuelle à terme échu. Quel plan tarifaire recommanderiez-vous au client ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Abonnement",
          "is_correct": false
        },
        {
          "statement": "Essai de SAP BTP",
          "is_correct": false
        },
        {
          "statement": "SAP BTPEA",
          "is_correct": false
        },
        {
          "statement": "Paiement à l'utilisation pour SAP BTP",
          "is_correct": true
        }
      ],
      "explanation": "Le plan tarifaire 'Pay-As-You-Go for SAP BTP' est idéal pour les clients qui recherchent de la flexibilité et une facturation mensuelle à terme échu. Ce modèle permet aux organisations de consommer des services et de payer en fonction de l'utilisation réelle, ce qui le rend adapté aux charges de travail dynamiques ou aux projets pilotes. En revanche, le modèle 'Abonnement 'nécessite un engagement initial et une facturation fixe, tandis que 'l'essai SAP BTP 'est limité à des fins d'évaluation et ne convient pas à la production. 'SAP BTPEA 'fait référence aux contrats d'entreprise et peut ne pas offrir de flexibilité de facturation mensuelle. Pour mémoriser cela, associez 'Pay-As-You-Go' à 'Custom-Based Billing'.",
      "Source_URL": [
        "https://www.sap.com/products/technology-platform/btp/pricing.html",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/pricing-models"
      ]
    },
    {
      "id": 68,
      "statement": "Un client a développé une application. Cette application se bloque de temps en temps. Ils veulent collecter des métriques et des traces de plantage de l'application. Ils sont particulièrement impressionnés par la spécification OpenSearch d'Apache et aimeraient vous la fournir, si elle est disponible. Quels services SAP BTP recommanderiez-vous ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Service de journalisation des applications SAP pour SAP BTP",
          "is_correct": true
        },
        {
          "statement": "Service de gestion du cloud SAP pour SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Service de journal d'audit SAP",
          "is_correct": false
        },
        {
          "statement": "Service de journalisation SAP Cloud",
          "is_correct": true
        }
      ],
      "explanation": "Pour collecter des métriques et des traces pour les plantages d'applications, en particulier à l'aide des spécifications OpenSearch, SAP recommande d'utiliser le 'SAP Application Logging service for SAP BTP' et le 'SAP Cloud Logging service'. Ces services prennent en charge la collecte centralisée des journaux, l'analyse et l'intégration avec des outils compatibles avec OpenSearch. Le 'service SAP Audit Log 'se concentre sur la journalisation de la sécurité et de la conformité, et non sur les mesures de performance. Le 'service SAP Cloud Management 'est utilisé pour la gestion des comptes globaux et des droits, et non pour la journalisation au niveau de l'application. Pour vous en souvenir, associez 'Application Logging' aux journaux au niveau de l'application et 'Cloud Logging' au stockage évolutif des journaux.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-cloud-logging",
        "https://help.sap.com/docs/btp/sap-application-logging"
      ]
    },
    {
      "id": 69,
      "statement": "Quel est le principal avantage d'une architecture événementielle dans les stratégies d'intégration ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Fonctionnement isolé et indépendant du système",
          "is_correct": false
        },
        {
          "statement": "Traitement et réponse en temps réel aux événements commerciaux",
          "is_correct": true
        },
        {
          "statement": "Intervention manuelle pour chaque événement commercial",
          "is_correct": false
        },
        {
          "statement": "Traitement retardé des événements commerciaux",
          "is_correct": false
        }
      ],
      "explanation": "L'architecture événementielle permet aux systèmes de répondre aux événements commerciaux en temps réel, améliorant ainsi l'agilité et l'évolutivité. Cette approche dissocie les producteurs et les consommateurs d'événements, permettant une communication asynchrone et un traitement plus rapide. La bonne réponse met en évidence le 'traitement en temps réel', qui est le principal avantage. Les autres options (intervention manuelle, traitement retardé et opérations isolées) contredisent les principes de la conception pilotée par les événements. Pour conserver cela, associez 'event-driven' à 'real-time reaction'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/integrate-your-sap-and-third-party-systems-with-sap-integration-suite",
        "https://help.sap.com/docs/integration-suite/event-driven-integration"
      ]
    },
    {
      "id": 70,
      "statement": "Quels sont les principaux avantages de l'utilisation de la méthodologie de conseil en solutions d'intégration (ISA-M) de SAP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Permet une intégration transparente avec des systèmes tiers",
          "is_correct": false
        },
        {
          "statement": "Normalise les pratiques d'intégration dans l'ensemble de l'organisation",
          "is_correct": true
        },
        {
          "statement": "Facilite le déploiement de solutions d'intégration sur SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Fournit un cadre pour la conception de solutions d'intégration",
          "is_correct": true
        }
      ],
      "explanation": "La méthodologie de conseil en matière de solutions d'intégration (ISA-M) de SAP fournit un cadre structuré pour la conception et la normalisation des pratiques d'intégration au sein d'une organisation. Il aide les architectes à choisir les technologies et les modèles d'intégration appropriés en fonction des besoins de l'entreprise. Les bonnes réponses mettent l'accent sur la normalisation et la conception du cadre. Les mauvaises options (intégration transparente par des tiers et facilitation du déploiement) sont des résultats, mais pas des avantages fondamentaux de l'ISA-M. Pour vous en souvenir, considérez 'ISA-M'comme le 'plan d'intégration'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/integrate-your-sap-and-third-party-systems-with-sap-integration-suite",
        "https://help.sap.com/docs/integration-suite/integration-solution-advisory-methodology"
      ]
    },
    {
      "id": 71,
      "statement": "Pour se conformer au Règlement général sur la protection des données (RGPD), une entreprise souhaite créer une application qui permet à ses utilisateurs de fournir des informations sur les systèmes de l'entreprise. Quel service SAP BTP fournit les API pour construire l'application ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Gestionnaire de rétention des données SAP",
          "is_correct": false
        },
        {
          "statement": "SAP Personal Data Manager",
          "is_correct": false
        },
        {
          "statement": "Intégration de la confidentialité des données SAP",
          "is_correct": true
        },
        {
          "statement": "Magasin d'informations d'identification SAP",
          "is_correct": false
        }
      ],
      "explanation": "Pour se conformer au RGPD (droits d'accès/d'effacement), le service SAP BTP concerné est **SAP Data Privacy Integration (DPI)**. DPI expose des API de demande de personne concernée (DSR) qui vous permettent de créer, de suivre et d'orchestrer les demandes des personnes concernées (accès, rectification, effacement) via des applications cloud SAP connectées. Il fournit l'agrégation et le routage vers les systèmes cibles, avec journalisation et suivi de l'état pour la conformité.\n\nD'autres options ne conviennent pas : **SAP Data Retention Manager** gère les politiques de rétention/suppression basées sur des règles métier, et non sur la gestion DSR de bout en bout ; **SAP Personal Data Manager** se concentre sur la gestion des données personnelles dans des produits spécifiques, et non sur l'orchestration multi-solutions via BTP ; **SAP Credential Store** gère les secrets et les certificats, sans rapport avec les demandes RGPD.\n\n**Astuce mémoire** : *DSR → DPI* (Data Subject Request → Data Privacy Integration).",
      "Source_URL": [
        "https://help.sap.com/docs/data-privacy-integration",
        "https://learning.sap.com/learning-journeys/data-privacy-and-protection-on-sap-btp"
      ]
    },
    {
      "id": 72,
      "statement": "La société XYZ, une entreprise mondiale avec 25K+ employés répartis en Europe (siège), aux États-Unis (m< (achats), migre vers SAP S/4HANA en utilisant SAP BTP. Chaque emplacement géographique dispose d'un personnel informatique dédié qui gère les quotas de ressources BTP. Pour le contrôle des coûts, l'entreprise vise à analyser et à optimiser l'utilisation et le coût de l'emplacement géographique de SAP BTP, dans le but d'améliorer la structure de son modèle de compte SAP BTP. Lequel des modèles de compte SAP BTP suivants est approprié ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Un compte global avec un annuaire pour chaque région",
          "is_correct": true
        },
        {
          "statement": "Un compte global avec un sous-compte pour chaque région",
          "is_correct": true
        },
        {
          "statement": "Un compte global pour chaque fonction commerciale avec un sous-compte correspondant pour cette région",
          "is_correct": false
        },
        {
          "statement": "Un compte global pour chaque fonction commerciale avec un répertoire correspondant pour cette région",
          "is_correct": false
        }
      ],
      "explanation": "Pour gérer les coûts et les quotas par région tout en maintenant une gouvernance unifiée, deux modèles de compte SAP BTP sont appropriés :\n\n1) Un compte global avec un annuaire pour chaque région : L'annuaire agit comme un conteneur logique pour regrouper les sous-comptes régionaux, appliquer des politiques communes et agréger la visibilité/les coûts.\n2) Un compte global avec un sous-compte pour chaque région :  Il s'agit d'une solution directe si la structure est simple, chaque sous-compte ayant ses propres droits/quotas et facturation.\n\nEn revanche, la multiplication des comptes globaux par fonction métier complique la gouvernance, disperse les droits et rend l'optimisation interrégionale plus difficile. Les annuaires et les sous-comptes sont spécialement conçus pour être structurés par région/secteur d'activité/environnement sous un seul compte global.\n\nAstuce : Compte global = parapluie ; Annuaire = groupement régional ; Sous-compte = unité exploitée/facturée.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-business-technology-platform/account-model",
        "https://learning.sap.com/learning-journey/explore-sap-business-technology-platform/manage-global-accounts-directories-and-subaccounts"
      ]
    },
    {
      "id": 73,
      "statement": "Vous êtes un architecte de solutions qui contribue à la conception d'une application personnalisée pour les utilisateurs professionnels. Vous devez suivre ces utiliser cz. L'application nécessite des données provenant uniquement de l'édition publique de SAP S/4HANA Cloud. L'application prend en charge les opérations de création, de lecture, de mise à jour et de suppression (CRUD). Si plusieurs protocoles backend sont applicables, c'est celui qui offre les performances les plus rapides qui doit être utilisé. Laquelle des combinaisons suivantes recommanderiez-vous pour la conception de l'application ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Frontend : SAP Fiori | Backend : liaison RFC sur SAP S/4HANA Cloud",
          "is_correct": false
        },
        {
          "statement": "Frontend : SAP Fiori | Backend : liaison de service OData sur SAP S/4HANA Cloud",
          "is_correct": true
        },
        {
          "statement": "Frontend : Applications de construction SAP | Backend : liaison IDoc sur SAP S/4HANA Cloud",
          "is_correct": false
        },
        {
          "statement": "Frontend : Applications de construction SAP | Backend : liaison SOAP sur SAP S/4HANA Cloud",
          "is_correct": false
        }
      ],
      "explanation": "Pour un frontend SAP Fiori consommant SAP S/4HANA Cloud, édition publique avec des opérations CRUD, l'option recommandée est la liaison de service OData. Les API OData (V2/V4) sont l'interface standard pour les applications Fiori, prenant en charge les opérations CRUD, la gestion des erreurs, les annotations sémantiques et la pagination, tout en offrant d'excellentes performances dans le cloud.\n\nD'autres choix ne conviennent pas : RFC n'est pas exposé dans l'édition publique ; IDoc est asynchrone/orienté EDI et n'est pas conçu pour l'application CRUD ; SOAP existe pour certains scénarios, mais n'est pas l'option préférée pour Fiori et a une charge utile plus lourde que l'OData moderne.\n\nAstuce : OData Fiori ↔ ; pour l'édition publique S/4HANA Cloud, utilisez API Hub OData et la liaison Fiori Elements.",
      "Source_URL": [
        "https://help.sap.com/docs/SAP_S4HANA_CLOUD/abap-restful-and-odata-apis-in-sap-s-4hana-cloud",
        "https://api.sap.com/products/SAPS4HANACloud/apis"
      ]
    },
    {
      "id": 74,
      "statement": "Quel est l'objectif de la méthodologie d'analyse de données (DAM) de SAP au sein de l'écosystème SAP BTP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Fournir les meilleures pratiques pour le déploiement de SAP Analytics Cloud",
          "is_correct": false
        },
        {
          "statement": "Pour normaliser les pratiques d'intégration de données dans les systèmes SAP",
          "is_correct": false
        },
        {
          "statement": "Pour guider le développement d'applications data-driven",
          "is_correct": true
        },
        {
          "statement": "Pour décrire l'utilisation de l'apprentissage automatique dans l'analyse de données",
          "is_correct": false
        }
      ],
      "explanation": "La méthodologie d'analyse de données (DAM) de SAP fournit un cadre structuré pour la conception et la mise en œuvre d'applications axées sur les données sur SAP BTP : elle couvre la portée de la valeur, la gouvernance, l'approvisionnement/la qualité des données, la modélisation sémantique, l'orchestration et l'exposition à l'analyse/planification. Le DAM guide la transition des cas d'utilisation métier aux artefacts techniques (Datasphere, HANA Cloud, SAC), en assurant la traçabilité et la réutilisabilité.\n\nIl ne se limite pas au déploiement de SAC, ne se contente pas de standardiser l'intégration et ne prescrit pas uniquement l'utilisation du machine learning ; il englobe l'ensemble du cycle de vie des données, des données à l'information et à l'action.\n\nAstuce : DAM = From Data Idea to Decision, on BTP.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/plan-and-realize-data-analytics-on-sap-btp",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/data-and-analytics-overview"
      ]
    },
    {
      "id": 75,
      "statement": "Quel service SAP BTP utiliseriez-vous pour assurer une gestion sécurisée des identités sur plusieurs applications cloud ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Gouvernance de l'accès aux identités SAP Cloud",
          "is_correct": false
        },
        {
          "statement": "Service de provisionnement d'identité SAP",
          "is_correct": true
        },
        {
          "statement": "Service d'authentification d'identité SAP",
          "is_correct": true
        },
        {
          "statement": "Fournisseur d'identité de la plate-forme technologique d'entreprise SAP",
          "is_correct": false
        }
      ],
      "explanation": "Pour une gestion sécurisée des identités sur plusieurs applications cloud, combinez SAP Identity Authentication Service (IAS) et SAP Identity Provisioning Service (IPS). IAS fournit l'authentification (OpenID Connect/SAML), fédère les fournisseurs d'identité externes, applique l'authentification multifacteur et les politiques d'accès. IPS automatise le provisionnement et le déprovisionnement via des connecteurs (SAP et tiers), garantissant des rôles et des groupes cohérents entre les applications.\n\nCloud Identity Access Governance (IAG) se concentre sur les contrôles d'accès/SoD et les révisions ; le fournisseur d'identité BTP n'est pas un service distinct pour la gouvernance multi-applications.\n\nAstuce : IAS = AuthN/MFA/Federation ; IPS = (De-)Provisioning.",
      "Source_URL": [
        "https://help.sap.com/docs/identity-authentication",
        "https://help.sap.com/docs/identity-provisioning"
      ]
    },
    {
      "id": 76,
      "statement": "Quel est l'objectif de la méthodologie d'extension d'application (AEM) de SAP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Fournir des lignes directrices pour l'intégration de SAP BTP avec des applications tierces",
          "is_correct": false
        },
        {
          "statement": "Pour décrire les pratiques de sécurité pour le développement d'applications SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Pour normaliser le processus de déploiement des applications SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Définir les meilleures pratiques pour l'extension des applications SAP à l'aide de SAP BTP",
          "is_correct": true
        }
      ],
      "explanation": "L'objectif de la méthodologie d'extension d'application (AEM) de SAP est de fournir un cadre normatif et les meilleures pratiques pour étendre durablement les applications SAP à l'aide de SAP BTP. AEM structure le cycle de vie en phases (évaluation du cas d'utilisation de l'extension, évaluation des technologies, définition de la solution cible, mise en œuvre/industrialisation de l'extension) afin d'aligner les besoins de l'entreprise, la sécurité (Clean Core) et l'architecture (côte à côte, in-app, événements, API). Il explique comment choisir entre ABAP RAP, CAP, SAPUI5/Fiori, Integration Suite, Datasphere ou Build Process Automation, et comment gérer la gouvernance, les droits/quotas, la qualité et les opérations (CI/CD). Les autres options sont trop partielles : l'intégration de tiers, la sécurité ou le déploiement ne sont que des dimensions couvertes par le framework, et non son objectif principal. Conseil : Considérez AEM comme la boussole d'extension : ce qu'il faut étendre (cas d'utilisation), avec quoi (technologies), comment (architecture) et où (BTP).",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-business-technology-platform/application-extension-methodology",
        "https://learning.sap.com/learning-journeys/extend-sap-s-4hana-with-sap-business-technology-platform/understand-the-sap-application-extension-methodology"
      ]
    },
    {
      "id": 77,
      "statement": "Quelles sont les options de déploiement prises en charge par le modèle de programmation d'application (RAP) ABAP RESTful sur SAP BTP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Déploiement dans le cloud uniquement",
          "is_correct": false
        },
        {
          "statement": "Déploiement à la fois dans le cloud et sur site",
          "is_correct": true
        },
        {
          "statement": "Déploiement sur site uniquement",
          "is_correct": false
        },
        {
          "statement": "Déploiement hybride avec des composants cloud et on-premise",
          "is_correct": false
        }
      ],
      "explanation": "Le modèle de programmation d'applications (RAP) ABAP RESTful prend en charge à la fois les déploiements cloud (environnement ABAP sur SAP BTP, édition publique S/4HANA Cloud) et les déploiements sur site (SAP S/4HANA on-premise/Private Cloud avec la plate-forme ABAP moderne). RAP fournit un modèle de programmation unifié (définitions de données/comportements, services REST/OData, interfaces utilisateur Fiori) pour construire des applications extensibles et maintenables quel que soit l'environnement cible. Dire 'cloud-only 'ou 'on-premise-only 'est incorrect : RAP est spécifiquement conçu pour unifier les pratiques entre cloud et on-premise. Le 'mode hybride 'n'est pas un type de déploiement RAP distinct ; il s'agit plutôt d'extensions côte à côte (sur BTP) ou d'extensions in-app (dans S/4HANA). Astuce : RAP = RESTful ABAP partout → même paradigme pour le cloud et sur site.",
      "Source_URL": [
        "https://help.sap.com/docs/abap-cloud/abap-restful-application-programming-model",
        "https://learning.sap.com/learning-journeys/develop-abap-applications-on-sap-btp/abap-restful-application-programming-model-rap"
      ]
    },
    {
      "id": 78,
      "statement": "Une entreprise met en œuvre SAP S/4HANA Cloud en même temps que SAP BTP. Ils ont besoin d'une application destinée au grand public. L'application doit également utiliser son propre sous-domaine SAP BTP unique. En tant qu'architecte de solutions, on vous a demandé comment un nom de domaine unique peut être réalisé. Lequel des éléments suivants peut servir d'option ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Créer un nouveau domaine dans un nouveau compte global",
          "is_correct": false
        },
        {
          "statement": "Créer un nouveau domaine à l'aide du service de domaine personnalisé SAP",
          "is_correct": true
        },
        {
          "statement": "Créer un nouveau domaine dans un nouveau sous-compte",
          "is_correct": true
        },
        {
          "statement": "Créer un nouveau domaine dans un nouvel annuaire",
          "is_correct": false
        }
      ],
      "explanation": "Pour exposer une application publique avec un nom de domaine personnalisé, deux options sont pertinentes : (1) créer un nouveau sous-compte avec un sous-domaine unique (le sous-compte détermine le sous-domaine technique utilisé par les runtimes et les URL), et/ou (2) utiliser le service de domaine personnalisé SAP pour mapper le FQDN de votre entreprise (par exemple, app.your-domain.com) aux points de terminaison de l'application BTP (HTTP/S). La création d'un domaine au niveau du compte global ou de l'annuaire n'est pas prise en charge : la granularité opérationnelle pour les domaines d'application se fait au niveau du sous-compte et via le service de domaine personnalisé pour le routage et les certificats TLS. Astuce : Sous-compte = sous-domaine technique ; Domaine personnalisé = nom de domaine complet public géré.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-business-technology-platform/subaccounts#subaccount-subdomain",
        "https://help.sap.com/docs/btp/sap-custom-domain-service"
      ]
    },
    {
      "id": 79,
      "statement": "Comment les capacités pilotées par l'IA sont-elles intégrées dans le SAP Analytics Cloud ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "En intégrant des modèles d'apprentissage automatique et des analyses prédictives.",
          "is_correct": true
        },
        {
          "statement": "En mettant l'accent sur la gestion de la relation client.",
          "is_correct": false
        },
        {
          "statement": "En fournissant des outils pour le montage vidéo et la gestion des médias sociaux.",
          "is_correct": false
        },
        {
          "statement": "En offrant des fonctionnalités de saisie manuelle des données.",
          "is_correct": false
        }
      ],
      "explanation": "Dans **SAP Analytics Cloud (SAC)**, les capacités pilotées par l'IA sont fournies par le biais de **analytique augmentée** : **Smart Insights**, **Search to Insight**, **Smart Predict** (classification, régression, séries chronologiques), de détection d'anomalies et de fonctionnalités d'explication automatisées. SAC intègre des modèles d'apprentissage automatique et des analyses prédictives pour aider les utilisateurs (pré-modélisation, fonctionnalités AutoML), en tirant parti de la sémantique de Datasphere/HANA. Les autres options (CRM, montage vidéo, saisie manuelle des données) ne correspondent pas à l'objectif de SAC. Astuce : *SAC = BI + Planification + Prédictif* ; rappelez-vous 'Smart' pour les fonctionnalités de l'IA.",
      "Source_URL": [
        "https://help.sap.com/docs/analytics-cloud/sap-analytics-cloud/augmented-analytics-in-sap-analytics-cloud",
        "https://learning.sap.com/learning-journeys/explore-sap-analytics-cloud/use-predictive-features-and-smart-assist"
      ]
    },
    {
      "id": 80,
      "statement": "Quelles sont les principales capacités de la suite d'intégration SAP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Traitement isolé des données, intégrations manuelles et accès limité aux API",
          "is_correct": false
        },
        {
          "statement": "Intégrations à usage unique, pas de solutions prédéfinies et sécurité minimale",
          "is_correct": false
        },
        {
          "statement": "Outils d'intégration complets, intégrations prédéfinies et gestion des API",
          "is_correct": true
        },
        {
          "statement": "Gestion de base des données, pas de gestion des API et protocoles d'intégration statiques",
          "is_correct": false
        },
        {
          "statement": "Ensemble d'outils restreint, pas d'automatisation et support limité",
          "is_correct": false
        }
      ],
      "explanation": "**SAP Integration Suite** offre un **portefeuille complet** : **Gestion des API** (exposition, gouvernance, monétisation), **Intégration Cloud** (flux, mappages, connecteurs), **Event Mesh** (intégration pilotée par les événements), **Connecteurs ouverts**, accélérateurs et **contenu pré-packagé** (SAP et non-SAP) via **API Business Hub**, ainsi que des capacités de sécurité (politiques, OAuth2/JWT), d'observabilité et d'outillage (DevOps, tests, *conseil* ISA-M). Les options décrivant des intégrations 'isolées', 'pas de contenu pré-packagé' ou 'pas de gestion d'API' sont incorrectes : l'objectif est justement d'unifier les modèles, d'industrialiser et de sécuriser les intégrations. **Astuce** : *Suite d'intégration = Connecter + Gouverner + Automatiser (API/Flux/Événements)*.",
      "Source_URL": [
        "https://help.sap.com/docs/integration-suite/overview-of-sap-integration-suite",
        "https://learning.sap.com/learning-journeys/become-an-integrated-intelligent-enterprise-with-sap-integration-suite"
      ]
    },
    {
      "id": 81,
      "statement": "Un client met en œuvre une nouvelle solution de gestion des données de référence sur SAP BTP. Ils doivent s'assurer que la solution peut gérer des données provenant de plusieurs sources, y compris des systèmes non SAP, et fournir une synchronisation en temps réel sur tous les systèmes. Que doit inclure l'architecture ?",
      "guidelines": "Il y a 3 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Une approche hybride avec des composants à la fois on-premise et cloud",
          "is_correct": false
        },
        {
          "statement": "Connecteurs sur mesure pour les systèmes non-SAP",
          "is_correct": false
        },
        {
          "statement": "SAP Data Intelligence pour la fédération de données",
          "is_correct": true
        },
        {
          "statement": "Suite d'intégration SAP pour la synchronisation des données en temps réel",
          "is_correct": true
        },
        {
          "statement": "Gouvernance des données de référence SAP sur SAP BTP",
          "is_correct": true
        }
      ],
      "explanation":  "Une architecture cible de gestion des données de référence (MDM) robuste sur SAP BTP devrait combiner (1) **SAP Master Data Governance (MDG)** pour posséder des enregistrements de référence et des processus de qualité des données, (2) **SAP Data Intelligence Cloud** pour fédérer, virtualiser et orchestrer les données à partir de sources SAP et non-SAP hétérogènes, et (3) **SAP Integration Suite** pour synchroniser les modifications des données de référence avec toutes les applications consommatrices en temps (quasi) réel via des API/événements. MDG fournit une gouvernance (validateurs, workflows, contrôles en double, consolidation/gouvernance centrale) et un modèle de données de référence. La Data Intelligence ajoute la connectivité, la gestion des métadonnées et l'orchestration du pipeline pour contrôler les sources non SAP sans codage point à point lourd. Integration Suite offre l'intégration cloud, la gestion des API et le maillage d'événements pour exposer les services, transformer les charges utiles et envoyer des deltas/notifications d'événements à grande échelle. Choix incorrects : une instruction générique 'hybride' est trop vague pour être une capacité architecturale ; les connecteurs personnalisés augmentent la dette technique par rapport à l'utilisation d'adaptateurs certifiés dans Integration Suite/Data Intelligence. **Mnémonique** : *MDM = MDG (gouverner) + DI (fédérer) + SI (synchroniser).*",
      "Source_URL": [
        "https://help.sap.com/docs/MDG",
        "https://help.sap.com/docs/data-intelligence-cloud",
        "https://help.sap.com/docs/integration-suite/overview-of-sap-integration-suite"
      ]
    },
    {
      "id": 82,
      "statement": "Quel est un composant clé de la sécurité dans SAP BTP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP HANA",
          "is_correct": false
        },
        {
          "statement": "Audit de sécurité SAP",
          "is_correct": false
        },
        {
          "statement": "Gestion des Identités et des Accès (IAM)",
          "is_correct": true
        },
        {
          "statement": "SAP Business Application Studio",
          "is_correct": false
        }
      ],
 "explanation": "Un pilier clé de la sécurité sur SAP BTP est la gestion des identités et des accès (IAM)**. IAM couvre l'authentification, l'autorisation et le provisionnement des utilisateurs/rôles sur les comptes et sous-comptes globaux. Avec l'authentification SAP Identity (SAML 2.0/OpenID Connect, MFA, fédération d'identités) et SAP Identity Provisioning (propagation des rôles/groupes), BTP applique l'accès au moindre privilège par le biais de collections de rôles et d'étendues. Les services de plateforme s'intègrent au service BTP Authorization & Trust Management afin que les jetons d'application (JWT) portent les bonnes revendications. En revanche, SAP HANA est une technologie de base de données, l'audit de sécurité est une fonction de certains systèmes SAP (et non la couche IAM multiplateforme) et SAP Business Application Studio est un IDE. **Astuce** : pensez *qui êtes-vous ?* (authentification) et *que pouvez-vous faire ?* (autorisation) → IAM.",
      "Source_URL": [
        "https://help.sap.com/docs/btp/sap-business-technology-platform/identity-and-access-management",
        "https://help.sap.com/docs/identity-authentication"
      ]
    },
    {
      "id": 83,
      "statement": "Dans quelle phase de la méthodologie de conseil en matière de solutions d'intégration SAP une cartographie technologique des cas d'utilisation des clients est-elle produite (pour un exemple de plan d'architecture de solution, voir le schéma ci-joint) ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [
        "images/img_00002.bmp"
      ],
      "answers": [
        {
          "statement": "Évaluez votre stratégie d'intégration",
          "is_correct": false
        },
        {
          "statement": "Définir les bonnes pratiques d'intégration",
          "is_correct": false
        },
        {
          "statement": "Permettre une pratique d'autonomisation",
          "is_correct": false
        },
        {
          "statement": "Concevez votre plateforme d'intégration hybride",
          "is_correct": true
        }
      ],
 "explanation": "Dans la méthodologie de conseil en solutions d'intégration (ISA-M) de SAP, la phase où la **cartographie technologique** des cas d'utilisation des clients est produite et où les **plans d'architecture de la solution** sont définis est **Concevez votre plateforme d'intégration hybride**. Au cours de cette phase, les architectes traduisent les styles et les modèles d'intégration métier (A2A, B2B, processus, données, événements, API) en capacités de plate-forme concrètes (intégration cloud, gestion des API, maillage d'événements, connecteurs ouverts, intelligence des données), sélectionnent les options de déploiement et les exigences non fonctionnelles, et créent des diagrammes de référence pour la livraison. Les phases précédentes (p. ex., 'Évaluez votre stratégie d'intégration ') se concentrent sur l'évaluation du paysage et les rôles/gouvernance ; 'Définir les meilleures pratiques d'intégration 'produit des politiques/normes ; 'Permettre une pratique d'autonomisation 'cible l'habilitation et le modèle opérationnel. **Mnémonique** : *Évaluer → Définir → Concevoir → Activer* ; la cartographie technologique vit dans **Concevoir**.",
      "Source_URL": [
        "https://community.sap.com/t5/technology-blogs-by-sap/isa-m-integration-solution-advisory-methodology/ba-p/13458390",
        "https://help.sap.com/docs/integration-suite/integration-solution-advisory-methodology"
      ]
    },
    {
      "id": 84,
      "statement": "Un client vous demande de fournir un plan tarifaire compte tenu des paramètres suivants : - Paiement annuel à l'avance - Achat de capacité supplémentaire telle que la mémoire ou le stockage sans pénalité - Utilisation de services SAP BTP supplémentaires sans pénalité Quel plan tarifaire recommanderiez-vous ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP BTPEA",
          "is_correct": true
        },
        {
          "statement": "Triat",
          "is_correct": false
        },
        {
          "statement": "Paiement à l'utilisation pour SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Abonnement",
          "is_correct": false
        }
      ],
 "explanation": "Compte tenu des exigences—**prépaiement annuel**, capacité à consommer **capacité/services supplémentaires sans pénalités**, et flexibilité commerciale—le plan approprié est **SAP BTP Enterprise Agreement (BTPEA)**. BTPEA fournit un engagement préfinancé utilisable pour tous les services BTP éligibles avec une facturation consolidée et la liberté d'augmenter l'utilisation (par exemple, plus de mémoire/stockage, ajouter de nouveaux services tels que Integration Suite ou HANA Cloud) sans renégocier à chaque fois.  Les  factures mensuelles à terme échu sont strictement conformes à l'utilisation, mais ne correspondent pas à l'exigence de prépaiement ; L'abonnement fixe les droits à des services spécifiques et est moins souple pour être étendu à moyen terme ; 'Essai' n'est pas destiné à la production/utilisation commerciale. **Astuce** : *BTPEA = commit once, flex many services*.",
      "Source_URL": [
        "https://www.sap.com/products/technology-platform/btp/pricing.html",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/commercial-models"
      ]
    },
    {
      "id": 85,
      "statement": "Quelle méthode est utilisée pour l'authentification sécurisée dans SAP BTP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Authentification multifacteur (MFA)",
          "is_correct": true
        },
        {
          "statement": "Authentification biométrique.",
          "is_correct": false
        },
        {
          "statement": "Accès par mot de passe unique.",
          "is_correct": false
        },
        {
          "statement": "Authentification unique",
          "is_correct": false
        }
      ],
 "explanation": "**L'authentification multifacteur (MFA)** est une méthode recommandée pour **l'authentification sécurisée** sur SAP BTP. Avec l'authentification d'identité SAP, vous pouvez appliquer des politiques MFA (par exemple, mot de passe + application d'authentification, FIDO2/WebAuthn, OTP SMS/e-mail) par application ou groupe d'utilisateurs, réduisant ainsi considérablement le risque de prise de contrôle de compte par rapport aux mots de passe à facteur unique. Bien que l'authentification unique (SSO) améliore l'expérience utilisateur, elle n'augmente pas en soi le niveau d'assurance à moins qu'elle ne soit associée à l'authentification multifacteur chez le fournisseur d'identité. L''authentification biométrique 'peut être utilisée comme un facteur via les dispositifs FIDO2, mais n'est pas la méthode BTP globale ; L'accès par mot de passe unique est explicitement déconseillé. **Mnémonique** : *Authentification forte sur BTP = SSO + MFA*, MFA étant le différenciateur de sécurité.",
      "Source_URL": [
        "https://help.sap.com/docs/identity-authentication/multi-factor-authentication",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/security-overview"
      ]
    },
    {
      "id": 86,
      "statement": "Vous concevez une solution sur SAP BTP pour une grande entreprise. L'entreprise dispose déjà de systèmes ERP SAP sur site et prévoit d'étendre ses capacités à l'aide de SAP BTP. La solution doit inclure de nouvelles applications basées sur le cloud et une intégration avec les systèmes existants. Quelles sont les principales considérations à prendre en compte dans la conception de votre architecture ?",
      "guidelines": "Il y a 3 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Mettre en œuvre une solution de gestion des identités hybride pour prendre en charge à la fois les applications sur site et dans le cloud",
          "is_correct": true
        },
        {
          "statement": "Concevoir l'architecture pour tirer parti de SAP BTP' en minimisant le code personnalisé dans le système ERP",
          "is_correct": true
        },
        {
          "statement": "Développez les nouvelles applications directement dans l'environnement sur site pour réduire la complexité",
          "is_correct": false
        },
        {
          "statement": "Utilisez SAP Integration Suite pour une intégration transparente des données entre les systèmes sur site et dans le cloud",
          "is_correct": true
        },
        {
          "statement": "Utiliser SAP BTP' pour construire des extensions côte à côte",
          "is_correct": false
        }
      ],
      "explanation": "Lors de la conception d'une solution SAP BTP hybride qui intègre des systèmes ERP sur site avec des applications basées sur le cloud, plusieurs principes architecturaux doivent être pris en compte :\n\n1. Gestion hybride des identités : Ceci est essentiel pour garantir une authentification et une autorisation transparentes sur les systèmes sur site et dans le cloud. SAP Identity Authentication Service (IAS) et Identity Provisioning Service (IPS) permettent une gestion centralisée du cycle de vie des identités, prenant en charge l'authentification unique et un accès sécurisé [1].\n\n2. **Clean Core Principle** : SAP recommande de minimiser le code personnalisé dans le noyau de l'ERP pour simplifier les mises à niveau et la maintenance. Au lieu de cela, les extensions doivent être construites à l'aide du modèle d'extensibilité côte à côte de SAP BTP, garantissant un noyau numérique propre et stable [2].\n\n3. *SAP Integration Suite** : Il s'agit de l'outil recommandé pour l'intégration de systèmes cloud et sur site. Il fournit des connecteurs, des API et des adaptateurs prédéfinis pour un échange de données transparent, prenant en charge la communication synchrone et asynchrone [3].\n\nRéponses incorrectes :\n- Le développement de nouvelles applications directement dans l'environnement sur site contredit la stratégie cloud-first et limite l'évolutivité.\n- Bien que l'extensibilité de SAP BTP soit importante, la question se concentre sur les considérations architecturales, et l'identité/l'intégration sont plus critiques.\n\n**Conseil mémoire** :  N'oubliez pas les trois piliers de l'architecture hybride : Identity, Integration et Clean Core.\n",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/developing-with-sap-extension-suite/implementing-hybrid-identity-management_LG_2f6b4e5e-3e2e-4e8e-9e3e-9b2e2e2e2e2e",
        "https://learning.sap.com/learning-journey/clean-core-for-sap-s-4hana-cloud-public-edition/understanding-the-clean-core-principle_LG_8f6b4e5e-3e2e-4e8e-9e3e-9b2e2e2e2e2e",
        "https://learning.sap.com/learning-journey/integrating-sap-s-4hana-using-sap-integration-suite"
      ]
    },
    {
      "id": 87,
      "statement": "Comment SAP Build Process Automation améliore-t-il l'automatisation des flux de travail ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "En intégrant l'IA pour automatiser les processus et gérer les flux de travail.",
          "is_correct": true
        },
        {
          "statement": "En gérant manuellement les tickets d'assistance client.",
          "is_correct": false
        },
        {
          "statement": "En concevant des produits physiques.",
          "is_correct": false
        },
        {
          "statement": "En créant des stratégies marketing.",
          "is_correct": false
        }
      ],
      "explanation": "SAP Build Process Automation améliore l'automatisation des flux de travail en intégrant des capacités d'IA pour automatiser les tâches répétitives et gérer efficacement les flux de travail. Il combine la gestion des flux de travail, l'automatisation des processus robotiques (RPA) et les services d'IA dans un environnement unifié low-code/no-code [1].\n\nRéponse correcte :\n- **Intégration de l'IA** : SAP Build Process Automation utilise l'IA pour extraire des données des documents, classer les entrées et prendre des décisions, réduisant ainsi les interventions manuelles et augmentant l'efficacité des processus [2].\n\nRéponses incorrectes :\n- La gestion manuelle des tickets d'assistance client contredit l'objectif d'automatisation.\n- La conception de produits physiques n'est pas liée à automatisation du flux de travail.\n- La création de stratégies marketing est une fonction commerciale, pas une fonctionnalité d'automatisation technique.\n\n**Conseil de mémoire** : Considérez SAP Build comme un assistant intelligent qui automatise les tâches à l'aide de l'IA, et non comme un outil manuel.\n",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/automate-business-processes-with-sap-build-process-automation",
        "https://help.sap.com/docs/build-process-automation"
      ]
    },
    {
      "id": 88,
      "statement": "Une entreprise prévoit de déployer une nouvelle application cloud sur SAP BTP. Ils veulent s'assurer que l'application est conforme aux exigences réglementaires dans différentes régions. Que doivent-ils prendre en compte dans l'architecture de leur solution ?",
      "guidelines": "Il y a 3 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Utiliser SAP' modèles de conformité prédéfinis dans SAP BTP",
          "is_correct": false
        },
        {
          "statement": "Tirez parti de SAP' Global Trust and Compliance pour répondre aux réglementations régionales",
          "is_correct": true
        },
        {
          "statement": "Mettre en œuvre des contrôles de résidence des données dans SAP BTP pour se conformer aux réglementations régionales en matière de confidentialité des données",
          "is_correct": true
        },
        {
          "statement": "Utiliser SAP BTP' pour assurer un contrôle d'accès sécurisé",
          "is_correct": false
        },
        {
          "statement": "Incorporer SAP Data Custodian pour surveiller la conformité des données",
          "is_correct": true
        }
      ],
      "explanation": "Lors du déploiement d'applications cloud sur SAP BTP dans plusieurs régions, la conformité aux réglementations locales est essentielle. SAP fournit plusieurs outils et services pour y parvenir :\n\n1. **SAP Global Trust and Compliance Services** : Ces services aident les organisations à répondre aux exigences légales et réglementaires régionales, notamment en matière de protection des données et de préparation aux audits [1].\n\n2. **Contrôles de résidence des données** : SAP BTP permet de configurer la résidence des données pour s'assurer que les données restent à l'intérieur de limites géographiques spécifiques, ce qui permet de se conformer à des lois telles que le RGPD [2].\n\n3. **SAP Data Custodian** : Cet outil offre une visibilité et un contrôle sur l'accès aux données, le chiffrement et la surveillance de la conformité dans les environnements cloud [3].\n\nRéponses incorrectes :\n- Les modèles de conformité prédéfinis ne sont pas une fonctionnalité essentielle de SAP BTP.\n- La gestion des identités garantit un accès sécurisé mais ne répond pas directement à la conformité réglementaire.\n\n**Astuce mémoire** : Pour la conformité, n'oubliez pas le trio :  Services de confiance, résidence des données et dépositaire.\n",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/implementing-data-protection-and-privacy-in-sap-cloud-solutions",
        "https://help.sap.com/docs/data-custodian",
        "https://community.sap.com/topics/data-privacy"
      ]
    },
    {
      "id": 89,
      "statement": "Quels sont les avantages d'utiliser le modèle de programmation d'applications (RAP) ABAP RESTful dans SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Développement simplifié de services basés sur OData",
          "is_correct": true
        },
        {
          "statement": "Prise en charge native des interfaces utilisateur Fiori",
          "is_correct": true
        },
        {
          "statement": "Capacités améliorées pour l'intégration avec des systèmes non-SAP",
          "is_correct": false
        },
        {
          "statement": "Performances optimisées pour les applications mobiles",
          "is_correct": false
        }
      ],
      "explanation": "Le modèle de programmation d'applications (RAP) ABAP RESTful est un cadre moderne pour le développement d'applications et de services SAP Fiori sur SAP BTP et S/4HANA. Il simplifie le développement d'applications d'entreprise à l'aide d'ABAP.\n\nRéponses correctes :\n- **Services OData simplifiés** : RAP fournit une prise en charge intégrée pour la création de services basés sur OData, réduisant ainsi le besoin de codage et de configuration manuels [1].\n- **Prise en charge native de Fiori** : RAP est étroitement intégré aux éléments SAP Fiori, ce qui permet le développement rapide d'interfaces utilisateur réactives avec un minimum d'effort [2].\n\nRéponses incorrectes :\n- Le RAP n'est pas spécifiquement conçu pour s'intégrer à des systèmes non SAP ; d'autres outils comme SAP Integration Suite sont mieux adaptés.\n- Bien que RAP prenne en charge les interfaces utilisateur adaptées aux mobiles, il n'est pas optimisé spécifiquement pour les performances mobiles.\n\n**Astuce mémoire** : RAP = RESTful + ABAP + Fiori = Développement rapide.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/developing-applications-with-abap-restful-application-programming-model",
        "https://help.sap.com/docs/abap-cloud"
      ]
    },
    {
      "id": 90,
      "statement": "Quelle phase de la méthodologie de conseil SAP Data and Analytics implique la définition des résultats commerciaux et des exigences de la solution ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Phase III : Carte des capacités et architecture de la solution",
          "is_correct": false
        },
        {
          "statement": "Phase IV : Gouvernance des données et feuilles de route",
          "is_correct": false
        },
        {
          "statement": "Cadrage et analyse de base",
          "is_correct": false
        },
        {
          "statement": "Phase II : Résultats opérationnels et exigences de la solution",
          "is_correct": true
        }
      ],
      "explanation": "Dans la méthodologie de conseil SAP Data and Analytics, la **Phase II : Résultats commerciaux et exigences de la solution** est l'endroit où les objectifs commerciaux sont définis et traduits en exigences techniques. Cette phase assure l'alignement entre la stratégie commerciale et l'architecture des données [1].\n\nRéponse correcte :\n- La phase II se concentre sur l'identification des KPI, des cas d'utilisation et des critères de réussite, constituant la base de la conception de la solution.\n\nRéponses incorrectes :\n- La phase III traite des capacités de cartographie et de la conception de l'architecture.\n- La phase IV se concentre sur la gouvernance et la planification de la feuille de route.\n- Le cadrage et l'analyse de base font partie de la phase initiale,  pas là où les exigences sont définies.\n\n**Astuce mémoire** : Phase II = Que voulons-nous accomplir et comment ?\n",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/defining-your-data-and-analytics-strategy-with-sap",
        "https://community.sap.com/topics/data-analytics"
      ]
    },
    {
      "id": 91,
      "statement": "Quelles sont les principales caractéristiques du modèle de programmation d'applications cloud (CAP) dans SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Il est exclusivement utilisé pour le développement d'applications basées sur ABAP",
          "is_correct": false
        },
        {
          "statement": "Il fournit un ensemble de bibliothèques et d'outils pour construire efficacement des applications d'entreprise sur SAP BTP",
          "is_correct": true
        },
        {
          "statement": "Il impose une stricte adhésion au modèle MVC (Model-View-Controller)",
          "is_correct": false
        },
        {
          "statement": "Il offre un support intégré pour la multi-location",
          "is_correct": true
        }
      ],
      "explanation": "Le Cloud Application Programming Model (CAP) est un cadre fourni par SAP pour la création de services et d'applications d'entreprise sur SAP BTP. Il n'est pas limité aux applications basées sur ABAP ; au lieu de cela, il prend en charge les environnements d'exécution Node.js et Java, ce qui le rend polyvalent pour les développeurs d'horizons différents. CAP fournit un ensemble complet de bibliothèques, d'outils et de conventions qui simplifient le développement, y compris CDS (Core Data Services) pour la modélisation des données, les définitions de services et les capacités d'intégration. L'une de ses principales caractéristiques est la prise en charge intégrée de l'architecture mutualisée, qui permet aux développeurs de créer des applications SaaS évolutives qui servent plusieurs clients avec des données et des configurations isolées. Les options incorrectes incluent l'affirmation selon laquelle CAP applique des modèles MVC stricts (CAP est flexible et n'impose pas MVC) et qu'il est exclusivement pour ABAP, ce qui est faux. Pour retenir les points forts de CAP, pensez à 'CAP = Core + Cloud + CDS + Multi-tenantancy'.",
      "Source_URL": [
        "https://cap.cloud.sap/docs/",
        "https://learning.sap.com/learning-journeys/developing-applications-with-sap-cloud-application-programming-model"
      ]
    },
    {
      "id": 92,
      "statement": "Quel est l'objectif de la réalisation du cadrage des domaines d'intégration ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Réduire le nombre de projets d'intégration",
          "is_correct": false
        },
        {
          "statement": "Pour limiter l'intégration à un seul département",
          "is_correct": false
        },
        {
          "statement": "Pour limiter l'intégration à des technologies spécifiques",
          "is_correct": false
        },
        {
          "statement": "Définir les limites et les domaines d'intérêt des efforts d'intégration",
          "is_correct": true
        },
        {
          "statement": "Pour éviter l'intégration avec des systèmes basés sur le cloud",
          "is_correct": false
        }
      ],
      "explanation": "La définition de la portée des domaines d'intégration est une étape critique dans la définition des limites et des domaines d'intérêt pour les efforts d'intégration. Il aide les organisations à identifier les systèmes, les processus et les flux de données qui doivent être intégrés, garantissant ainsi l'alignement sur les objectifs commerciaux et la faisabilité technique. Cette approche ne vise pas à réduire arbitrairement le nombre de projets ou à restreindre l'intégration à des départements ou des technologies. Au lieu de cela, il apporte clarté et hiérarchisation, ce qui permet une allocation efficace des ressources et une meilleure gouvernance. Éviter l'intégration avec les systèmes cloud est contre-productif dans les architectures d'entreprise modernes. Pour se rappeler l'objectif du cadrage, considérez-le comme 'préparer le terrain pour le succès de l'intégration '.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/integrate-and-extend-sap-solutions-on-sap-business-technology-platform"
      ]
    },
    {
      "id": 93,
      "statement": "Une entreprise est en train de mettre hors service son ancien système ERP en faveur de l'adoption de solutions SAP. L'entreprise n'est pas sûre de savoir quelle entreprise a trois objectifs commerciaux principaux : - Maintenir plusieurs processus commerciaux uniques. - Maintenir les solutions avec un petit budget, un temps et des ressources limités. - Intégrer plusieurs solutions non-SAP. Quelle combinaison de solutions le client doit-il adopter ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP Signavio | SAP S/4HANA Cloud édition publique | SAP BTP",
          "is_correct": true
        },
        {
          "statement": "SAP Lean IX | SAP S/4HANA Cloud édition privée | Orchestration des processus SAP",
          "is_correct": false
        },
        {
          "statement": "SAP Signavio | Édition publique SAP S/4HANA | Orchestration des processus SAP",
          "is_correct": false
        },
        {
          "statement": "SAP Lean IX | SAP S/4HANA sur site | SAP BTP",
          "is_correct": false
        }
      ],
      "explanation": "La bonne combinaison - SAP Signavio, SAP S/4HANA Cloud public edition et SAP BTP - répond efficacement aux objectifs de l'entreprise. SAP Signavio permet de modéliser et d'optimiser des processus métier uniques. L'édition publique de SAP S/4HANA Cloud offre un déploiement rapide, un coût total de possession réduit et des processus standardisés adaptés aux budgets et aux ressources limités. SAP BTP permet l'intégration avec des systèmes non SAP et offre une extensibilité. Parmi les autres options, citons SAP LeanIX, qui est plus axé sur l'architecture d'entreprise, et SAP Process Orchestration, qui est hérité et moins natif du cloud. Pour retenir ce trio, pensez à 'Signavio pour les processus, S/4HANA Cloud pour l'ERP core, BTP pour l'intégration et l'extension'.",
      "Source_URL": [
        "https://www.sap.com/products/technology-platform.html",
        "https://learning.sap.com/learning-journeys/implementing-sap-s-4hana-cloud-public-edition"
      ]
    },
    {
      "id": 94,
      "statement": "Un client souhaite établir une connectivité entre les applications exécutées par les utilisateurs finaux et le système backend sur site (SAP S/4HANA). Sur la base du schéma ci-joint, quelle combinaison est nécessaire pour établir la connectivité ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [
        "images/img_00003.bmp"
      ],
      "answers": [
        {
          "statement": "Service de connectivité pour 1 et Cloud Connector pour 2",
          "is_correct": true
        },
        {
          "statement": "Cloud Connector pour 1 et service de destination pour 2",
          "is_correct": false
        },
        {
          "statement": "Connecteur personnalisé pour 1 et service de connectivité pour 2",
          "is_correct": false
        },
        {
          "statement": "Service de destination pour 1 et service de connectivité pour 2",
          "is_correct": false
        }
      ],
      "explanation": "Pour établir une connectivité sécurisée entre les applications de l'utilisateur final et les systèmes SAP S/4HANA sur site, SAP recommande d'utiliser le service de connectivité et Cloud Connector. Le service de connectivité gère les destinations et les communications sécurisées de SAP BTP vers les systèmes backend. Le Cloud Connector agit comme un tunnel sécurisé entre SAP BTP et les systèmes sur site, permettant un accès contrôlé. D'autres options, telles que le connecteur personnalisé ou le service de destination seul, ne fournissent pas le lien sécurisé requis. Pour vous souvenir de cette configuration, pensez à 'Cloud Connector pour le tunnel sécurisé, Connectivity Service pour le routage'.",
      "Source_URL": [
        "https://help.sap.com/docs/connectivity-service",
        "https://learning.sap.com/learning-journeys/integrate-and-extend-sap-solutions-on-sap-business-technology-platform"
      ]
    },
    {
      "id": 95,
      "statement": "Quels sont les facteurs pris en compte dans la phase 3 de la méthodologie d'extension d'application SAP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Programmes de formation des employés",
          "is_correct": false
        },
        {
          "statement": "Exigences globales",
          "is_correct": true
        },
        {
          "statement": "Alignement technologique",
          "is_correct": true
        },
        {
          "statement": "Méthodes de cryptage des données",
          "is_correct": false
        }
      ],
      "explanation": "La phase 3 de la méthodologie d'extension des applications SAP se concentre sur l'évaluation des exigences globales et la garantie de l'alignement technologique. Cette phase permet de s'assurer que la stratégie d'extension répond aux besoins de l'entreprise et s'aligne sur les principes de base propres de SAP et les technologies prises en charge. La formation des employés et le cryptage des données sont importants, mais ne constituent pas l'objectif principal de cette phase. Pour vous souvenir de la phase 3, pensez à 'Exigences + Technologie = Ajustement d'extension'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/extending-sap-s-4hana-with-sap-business-technology-platform"
      ]
    },
    {
      "id": 96,
      "statement": "Un chef de projet a les exigences suivantes pour une nouvelle conception : - Lorsqu'il y a un déficit dans la quantité de matériaux à livrer par le fournisseur dans un bon de commande, un événement w Cloud par un travail de fond périodique. - L'événement commercial sera envoyé à SAP Event Mesh. Un processus personnalisé sera ensuite lancé dans un système sur site. - Le personnel informatique devra mettre en place plusieurs scénarios différents à l'aide de différents systèmes sur site. Le chef de projet souhaite une solution SAP BTP qui fournit des flux de travail guidés avec des tâches attribuables aux membres des scénarios informatiques. En tant qu'architecte de solution, lequel des éléments suivants recommandez-vous ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Automatisation des processus de construction SAP",
          "is_correct": false
        },
        {
          "statement": "Service d'automatisation de l'intégration dans le cloud",
          "is_correct": true
        },
        {
          "statement": "Automatisation intelligente de la situation",
          "is_correct": false
        },
        {
          "statement": "Pilote d'automatisation SAP",
          "is_correct": false
        }
      ],
      "explanation": "La bonne réponse est 'Cloud Integration Automation Service'. Ce service SAP BTP est conçu pour prendre en charge les flux de travail guidés pour les scénarios d'intégration, en particulier lorsque plusieurs systèmes sont impliqués. Il fournit des conseils étape par étape et des tâches assignables au personnel informatique pour configurer et déployer des flux d'intégration. Dans ce cas d'utilisation, où les événements sont déclenchés à partir de SAP S/4HANA Cloud et acheminés vers SAP Event Mesh, suivis d'un traitement personnalisé dans les systèmes sur site, Cloud Integration Automation Service permet d'orchestrer la configuration dans des environnements hybrides. SAP Build Process Automation est plus adapté à l'automatisation des processus d'entreprise qu'à la configuration de l'intégration technique. L'automatisation intelligente de la situation se concentre sur les situations et les réponses de l'entreprise, et non sur l'intégration. SAP Automation Pilot est utilisé pour l'automatisation opérationnelle, mais ne dispose pas des fonctionnalités de flux de travail guidé nécessaires ici.\n\n💡 Conseil de mémoire : Utilisez le service d'automatisation de l'intégration dans le cloud lorsqu'une configuration d'intégration guidée entre des systèmes hybrides est requise.\n",
      "Source_URL": [
        "https://help.sap.com/docs/cloud-integration-automation-service",
        "https://learning.sap.com/learning-journeys/integrate-and-extend-sap-s-4hana-cloud-public-edition"
      ]
    },
    {
      "id": 97,
      "statement": "Compte tenu des paramètres de cas d'utilisation suivants : - Les utilisateurs finaux devront redémarrer les messages dans SAP S/4HANA à l'aide de SAP AIF - Les utilisateurs finaux devront modifier la charge utile des messages dans SAP S/4HANA à l'aide de SAP AIF - Les principes d'intégration de base propres doivent être appliqués. Lequel des éléments suivants pourrait être utilisé comme 'adaptateur' dans le schéma ci-joint ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [
        "images/img_00004.bmp"
      ],
      "answers": [
        {
          "statement": "ODATA",
          "is_correct": false
        },
        {
          "statement": "HTTP",
          "is_correct": false
        },
        {
          "statement": "SAVON",
          "is_correct": true
        },
        {
          "statement": "IDOC",
          "is_correct": true
        }
      ],
      "explanation": "Les bonnes réponses sont 'SOAP' et 'IDOC'. SAP Application Interface Framework (AIF) prend en charge la surveillance des messages, la gestion des erreurs et la manipulation de la charge utile pour diverses technologies d'intégration. SOAP (Simple Object Access Protocol) est un protocole largement utilisé dans SAP pour les services Web et est compatible avec AIF. IDOC (Intermediate Document) est un format SAP traditionnel pour l'échange de données asynchrones et est entièrement pris en charge par AIF pour le redémarrage et la modification de la charge utile. ODATA et HTTP sont plus adaptés à la communication synchrone et à l'intégration de l'interface utilisateur, et ils n'offrent pas le même niveau de fonctionnalités de contrôle et de surveillance que SOAP et IDOC dans AIF.\n\n💡 Conseil de mémoire : Pour un contrôle approfondi des messages dans SAP AIF, pensez aux formats hérités tels que IDOC et aux protocoles structurés tels que SOAP.\n",
      "Source_URL": [
        "https://help.sap.com/docs/SAP_APPLICATION_INTERFACE_FRAMEWORK",
        "https://learning.sap.com/learning-journeys/integrate-and-extend-sap-s-4hana-cloud-public-edition"
      ]
    },
    {
      "id": 98,
      "statement": "Une entreprise prévoit d'utiliser SAP BTP pour gérer ses données de référence sur plusieurs systèmes, y compris des systèmes non SAP. Ils ont besoin d'une solution qui assure la cohérence et la synchronisation des données. Quelle approche répondrait le mieux à leurs besoins ?",
      "guidelines": "Il y a 3 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Utiliser SAP' pour chaque système séparément",
          "is_correct": false
        },
        {
          "statement": "Mettre en œuvre une approche fédérée à l'aide de SAP Data Intelligence",
          "is_correct": true
        },
        {
          "statement": "Développer une application personnalisée sur SAP BTP pour la gestion des données de référence",
          "is_correct": false
        },
        {
          "statement": "Mettre en œuvre la gouvernance des données de référence SAP sur SAP BTP",
          "is_correct": true
        },
        {
          "statement": "Utilisez SAP Integration Suite pour répliquer les données de référence entre les systèmes",
          "is_correct": true
        }
      ],
      "explanation": "Les bonnes réponses sont 'Mettre en œuvre une approche fédérée à l'aide de SAP Data Intelligence', 'Mettre en œuvre SAP Master Data Governance sur SAP BTP' et 'Utiliser SAP Integration Suite pour répliquer les données de référence entre les systèmes'. SAP Data Intelligence permet la gestion et l'orchestration fédérées des données sur les systèmes SAP et non-SAP. SAP Master Data Governance (MDG) sur BTP assure une gouvernance centralisée et assure la cohérence des données de référence. SAP Integration Suite facilite la réplication en temps réel et par lots des données de référence entre les systèmes. L'utilisation d'outils de réplication intégrés séparément pour chaque système ou le développement d'applications personnalisées manque d'évolutivité et de gouvernance.\n\n💡 Conseil de mémoire : Pour assurer la cohérence des données de référence entre les systèmes, combinez la gouvernance (MDG), l'orchestration (Data Intelligence) et l'intégration (Integration Suite).\n",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/manage-master-data-across-hybrid-landscapes",
        "https://help.sap.com/docs/data-intelligence",
        "https://help.sap.com/docs/integration-suite"
      ]
    },
    {
      "id": 99,
      "statement": "Quel service SAP BTP prend en charge le développement de modèles d'apprentissage automatique ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP Data Intelligence",
          "is_correct": true
        },
        {
          "statement": "SAP Business Application Studio",
          "is_correct": false
        },
        {
          "statement": "Fondation SAP AI",
          "is_correct": false
        },
        {
          "statement": "Noyau SAP AI",
          "is_correct": true
        }
      ],
      "explanation": "Les bonnes réponses sont 'SAP Data Intelligence' et 'SAP AI Core'. SAP Data Intelligence fournit des outils de préparation, d'orchestration et d'intégration des données, qui sont essentiels pour l'entraînement des modèles de machine learning. SAP AI Core est un environnement d'exécution permettant de déployer et de gérer des modèles de ML dans SAP BTP. SAP Business Application Studio est principalement un environnement de développement pour les applications UI et CAP, et non ML. SAP AI Foundation est un concept plus large qui inclut AI Core, mais n'est pas un service autonome pour le développement de modèles.\n\n💡 Astuce mémoire : Pour le développement ML, pensez à 'Core' pour l'exécution et à 'Data Intelligence' pour l'orchestration.\n",
      "Source_URL": [
        "https://help.sap.com/docs/ai-core",
        "https://learning.sap.com/learning-journeys/develop-intelligent-scenarios-with-sap-ai-core-and-sap-ai-launchpad",
        "https://help.sap.com/docs/data-intelligence"
      ]
    },
    {
      "id": 100,
      "statement": "Vous êtes un architecte de solutions affecté à un projet de transformation d'entreprise client. Quelles solutions recommanderiez-vous aux clients d'adopter pour analyser et optimiser leur processus d'approvisionnement afin de dépasser les références de l'industrie ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Gestionnaire de processus SAP Signavio",
          "is_correct": false
        },
        {
          "statement": "Gestionnaire de transformation des processus SAP Signavio",
          "is_correct": true
        },
        {
          "statement": "Accélérateurs de valeur SAP Signavio",
          "is_correct": false
        },
        {
          "statement": "SAP Signavio Process Intelligence",
          "is_correct": true
        }
      ],
      "explanation": "Les bonnes réponses sont 'SAP Signavio Process Transformation Manager' et 'SAP Signavio Process Intelligence'. Ces outils sont conçus pour analyser et optimiser les processus d'affaires. Process Transformation Manager permet de définir les objectifs de transformation et d'aligner les processus sur les références. Process Intelligence fournit des informations approfondies sur les performances des processus à l'aide de techniques d'exploration de processus. Process Manager se concentre davantage sur la modélisation et la documentation, tandis que les accélérateurs de valeur sont des modèles et non des outils analytiques.\n\n💡 Astuce mémoire : Pour l'optimisation et le benchmarking, utilisez 'Transformation Manager' pour la stratégie et 'Process Intelligence' pour l'analyse.\n",
      "Source_URL": [
        "https://www.signavio.com/products/process-intelligence/",
        "https://www.signavio.com/products/process-transformation-manager/",
        "https://learning.sap.com/learning-journeys/transform-business-processes-with-sap-signavio"
      ]
    },
    {
      "id": 101,
      "statement": "Vous êtes architecte de solutions et votre client a récemment réalisé une fusion et acquisition. Votre client utilise SAP S/4H La société acquise utilise SAP ECC 6.0. Pour des raisons commerciales et juridiques, les utilisateurs de la société acquise ne peuvent pas vous annuaire. Les utilisateurs acquis doivent toujours accéder à l'application personnalisée. Compte tenu du schéma ci-joint, quelle solution recommanderiez-vous à votre client en '1 ' pour permettre cet accès ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [
        "images/img_00005.bmp"
      ],
      "answers": [
        {
          "statement": "Service de gestion des autorisations et des approbations SAP",
          "is_correct": false
        },
        {
          "statement": "SAP Cloud Identity Services - Authentification de l'identité",
          "is_correct": true
        },
        {
          "statement": "SAP Cloud Identity Services - Provisionnement des identités",
          "is_correct": false
        },
        {
          "statement": "Service de connexion sécurisée SAP pour l'interface graphique SAP",
          "is_correct": false
        }
      ],
      "explanation": "La bonne réponse est 'SAP Cloud Identity Services - Identity Authentication'. Ce service permet l'authentification sécurisée des utilisateurs pour les applications cloud SAP et prend en charge les scénarios où les utilisateurs ne font pas encore partie d'un répertoire d'identité centralisé. Dans le cadre d'une fusion, où les utilisateurs de la société acquise ne peuvent pas encore être intégrés dans le fournisseur d'identité principal, l'authentification d'identité permet une gestion fédérée des accès. Il prend en charge les protocoles SAML 2.0 et OpenID Connect, ce qui permet des expériences de connexion transparentes entre différents domaines d'identité.\n\nD'autres options sont incorrectes :\n- 'SAP Authorization and Trust Management Service' gère les configurations d'autorisation et de confiance mais ne fournit pas de capacités d'authentification.\n- 'SAP Cloud Identity Services - Identity Provisioning' est utilisé pour le provisionnement des utilisateurs, et non pour l'authentification.\n- 'SAP Secure Login Service for SAP GUI' est spécifique à SAP GUI et ne convient pas pour applications personnalisées basées sur le Web.\n\n💡 Astuce mémoire : Utilisez 'Authentification' pour l'accès à la connexion, 'Provisionnement' pour la création d'utilisateurs et 'Autorisation' pour le contrôle des autorisations.",
      "Source_URL": [
        "https://help.sap.com/docs/identity-authentication",
        "https://learning.sap.com/learning-journey/implementing-identity-authentication"
      ]
    },
    {
      "id": 102,
      "statement": "Quels sont les cas d'utilisation courants pour l'architecture d'entreprise ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Réduire les efforts de marketing.",
          "is_correct": false
        },
        {
          "statement": "Augmentation des cours des actions.",
          "is_correct": false
        },
        {
          "statement": "Intégration post-fusion.",
          "is_correct": true
        },
        {
          "statement": "Rationalisation de l'application.",
          "is_correct": true
        },
        {
          "statement": "Limiter les commentaires des clients.",
          "is_correct": false
        }
      ],
      "explanation": "Les bonnes réponses sont 'Intégration post-fusion' et 'Rationalisation de l'application'. L'architecture d'entreprise (EA) fournit un cadre stratégique pour aligner les systèmes informatiques sur les objectifs commerciaux. L'intégration post-fusion est un cas d'utilisation courant de l'architecture d'entreprise, qui permet d'unifier des systèmes, des processus et des modèles de données disparates après des fusions ou des acquisitions. La rationalisation des applications implique l'évaluation et l'optimisation de l'environnement applicatif afin de réduire la redondance, d'améliorer l'efficacité et de réduire les coûts.\n\nOptions incorrectes :\n- 'Réduire les efforts de marketing' et 'Limiter les commentaires des clients' ne sont pas des objectifs typiques de l'EA.\n- 'L'augmentation des cours des actions' est un résultat commercial, et non un cas d'utilisation direct de l'EA.\n\n💡 Astuce mémoire : L'EA se concentre sur l'alignement informatique,  l'intégration et l'optimisation, et non la spéculation marketing ou financière.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/enterprise-architecture",
        "https://community.sap.com/topics/enterprise-architecture"
      ]
    },
    {
      "id": 103,
      "statement": "En tant qu'architecte de solutions, vous participez à une réunion au sujet de la conception d'une nouvelle application pour gérer le processus de livraison du gc qui doit être maintenu par le secteur d'activité (par opposition à l'informatique). Les paramètres/fonctionnalités d'application suivants sont abordés : - Suivi des livraisons en temps réel - Optimisation des itinéraires de livraison - Fournir des notifications de livraison aux clients. - Mise à l'échelle en fonction de l'utilisation - Les temps d'arrêt pour maintenance doivent être courts. Quel type d'extension est le mieux adapté à cette application ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Côte à côte",
          "is_correct": true
        },
        {
          "statement": "Utilisateur clé",
          "is_correct": false
        },
        {
          "statement": "Classique",
          "is_correct": false
        }
      ],
      "explanation": "La bonne réponse est 'Côte à côte'. Ce type d'extension est idéal pour les applications qui nécessitent une évolutivité, une maintenance indépendante et une intégration avec les systèmes centraux via des API. Dans ce cas, l'application de livraison a besoin d'un suivi en temps réel, d'une optimisation des itinéraires, de notifications aux clients et d'un temps d'arrêt minimal, autant de caractéristiques mieux prises en charge par les extensions côte à côte sur SAP BTP.\n\nOptions incorrectes :\n- Les extensions 'Utilisateur clé' sont limitées aux adaptations de l'interface utilisateur et sont conservées au sein du système central.\n- Les extensions 'Classique' impliquent des modifications du système central, ce qui contredit le principe de nettoyage du noyau et augmente la complexité de la maintenance.\n\n💡 Astuce mémoire :  'Side-by-side' = évolutif et indépendant ; 'Utilisateur clé' = ajustements de l'interface utilisateur ; 'Classique' = modifications de base.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/extending-sap-s-4hana-with-sap-extension-suite",
        "https://help.sap.com/docs/btp/sap-extension-suite"
      ]
    },
    {
      "id": 104,
      "statement": "Qu'est-ce que l'Intelligence Artificielle (IA) ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Une méthode de programmation d'ordinateurs pour suivre des instructions explicites",
          "is_correct": false
        },
        {
          "statement": "Un type de matériel utilisé dans les systèmes informatiques avancés",
          "is_correct": false
        },
        {
          "statement": "Un concept dépassé remplacé par l'informatique moderne",
          "is_correct": false
        },
        {
          "statement": "Technologies qui améliorent les capacités humaines en matière de perception, d'analyse, de prise de décision et d'actions",
          "is_correct": true
        }
      ],
      "explanation": "La bonne réponse est 'Technologies qui améliorent les capacités humaines en matière de perception, d'analyse, de prise de décision et d'actions'. L'intelligence artificielle (IA) fait référence aux systèmes qui simulent l'intelligence humaine pour effectuer des tâches telles que la reconnaissance de modèles, la prédiction et l'automatisation des décisions. Dans SAP BTP, L'IA est utilisée pour optimiser les processus métier, automatiser les flux de travail et améliorer l'expérience client.\n\nOptions incorrectes :\n- La programmation avec des instructions explicites relève de l'informatique traditionnelle, pas de l'IA.\n- L'IA n'est pas un type de matériel.\n- L'IA est un concept moderne, pas obsolète.\n\n💡 Astuce mémoire : IA = Intelligence augmentée, pas seulement l'automatisation ou le matériel.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/exploring-artificial-intelligence-on-sap-btp",
        "https://help.sap.com/docs/ai-core"
      ]
    },
    {
      "id": 105,
      "statement": "Quelle est la fonction principale de SAP Signavio dans l'automatisation d'entreprise ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Pour limiter l'utilisation de l'IA dans l'automatisation.",
          "is_correct": false
        },
        {
          "statement": "Pour entrer manuellement des données dans les systèmes.",
          "is_correct": false
        },
        {
          "statement": "Pour se concentrer sur l'intégration matérielle.",
          "is_correct": false
        },
        {
          "statement": "Pour analyser et améliorer les processus commerciaux.",
          "is_correct": true
        }
      ],
      "explanation": "La bonne réponse est 'Pour analyser et améliorer les processus d'entreprise'. SAP Signavio est une suite d'outils conçus pour l'intelligence des processus, la modélisation et la transformation. Il permet aux organisations de visualiser, d'évaluer et d'optimiser leurs processus métier à l'aide d'informations basées sur les données. C'est essentiel pour l'automatisation d'entreprise, où la compréhension et l'amélioration des flux de travail sont essentielles à l'efficacité.\n\nOptions incorrectes :\n- La limitation de l'IA, la saisie manuelle des données et l'intégration matérielle ne sont pas des fonctions de SAP Signavio.\n\n💡 Conseil de mémoire : Signavio = Signe d'amélioration des processus.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/transforming-business-processes-with-sap-signavio",
        "https://help.sap.com/docs/signavio"
      ]
    },
    {
      "id": 106,
      "statement": "Quels types d'extensibilité SAP BTP permettent de développer des extensions côte à côte sans modifier le système central ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Extensibilité hybride",
          "is_correct": false
        },
        {
          "statement": "Extensibilité intégrée",
          "is_correct": false
        },
        {
          "statement": "Extensibilité dans l'application",
          "is_correct": false
        },
        {
          "statement": "Extensibilité côte à côte",
          "is_correct": true
        }
      ],
      "explanation": "L'extensibilité côte à côte dans SAP BTP permet aux développeurs de créer des applications qui s'exécutent indépendamment du système SAP principal, en exploitant les API et les événements pour interagir avec le noyau sans le modifier. Cette approche soutient le principe du 'noyau propre', garantissant que le système central reste stable et évolutif. Contrairement à l'extensibilité intégrée ou in-app, qui implique des modifications au sein du système central ou des couches d'interface utilisateur, l'extensibilité côte à côte utilise des services tels que SAP Extension Suite et Cloud Foundry/Kyma runtimes pour héberger des applications personnalisées. Cette méthode est idéale pour les solutions évolutives et faiblement couplées qui nécessitent flexibilité et innovation sans affecter l'ERP de base. Pour vous en souvenir, associez 'côte à côte' à 'externe mais connecté'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/develop-side-by-side-extensions-on-sap-btp",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/extension-options"
      ]
    },
    {
      "id": 107,
      "statement": "Quel est l'axe stratégique d'un architecte d'entreprise par rapport à un architecte de solutions ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Une orientation stratégique plus élevée que l'orientation technologique.",
          "is_correct": true
        },
        {
          "statement": "Une emphase égale sur l'orientation stratégique et technologique.",
          "is_correct": false
        },
        {
          "statement": "Une orientation technologique plus élevée qu'une orientation stratégique.",
          "is_correct": false
        },
        {
          "statement": "Pas d'orientation stratégique, seulement une orientation technologique.",
          "is_correct": false
        }
      ],
      "explanation": "Les architectes d'entreprise se concentrent sur l'alignement de la stratégie informatique sur les objectifs commerciaux, garantissant l'évolutivité, la conformité et la valeur à long terme. Leur rôle est stratégique et implique la gouvernance, la cartographie des capacités et la planification de la transformation. En revanche, les architectes de solutions se concentrent davantage sur la mise en œuvre technique de solutions spécifiques. Par conséquent, les architectes d'entreprise ont une orientation stratégique plus élevée que l'orientation technologique. Cette distinction est essentielle dans les grandes organisations où l'architecture d'entreprise est le moteur de la transformation numérique. A retenir : 'Entreprise = Stratégie, Solution = Technologie'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/become-an-enterprise-architect",
        "https://community.sap.com/topics/enterprise-architecture"
      ]
    },
    {
      "id": 108,
      "statement": "Une analyse conforme aux normes a déterminé que l'application SAP Fiori fournie pour l'édition privée SAP S/4HANA Cloud était insuffisante sur la base des exigences commerciales existantes, et qu'une nouvelle application frontale devait être créée. En tant qu'architecte de solutions, on vous demande de proposer une solution et on vous dit ce qui suit : - La logique backend exécutée sur SAP S/4HANA Cloud private edition est suffisante et il existe une API distante appropriée pour les opérations de création, de lecture, de mise à jour et de suppression (CRUD). - L'application frontale doit pouvoir fonctionner sur une variété d'appareils tels que les téléphones mobiles et les tablettes. - Les instances d'application frontales doivent être mises à l'échelle automatiquement en fonction des paramètres de mise à l'échelle fournis par l'administrateur. Lequel des environnements d'exécution suivants serait optimal pour la nouvelle application frontale ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP BTP, environnement Neo",
          "is_correct": false
        },
        {
          "statement": "SAP BTP, runtime Cloud Foundry",
          "is_correct": true
        },
        {
          "statement": "Environnement SAP BTP et ABAP",
          "is_correct": false
        },
        {
          "statement": "SAP BTP, Kyma runtime",
          "is_correct": true
        }
      ],
      "explanation": "Les runtimes SAP BTP Cloud Foundry et Kyma sont optimaux pour la création d'applications front-end évolutives. Cloud Foundry prend en charge plusieurs langues et la mise à l'échelle automatique, ce qui le rend adapté aux applications mobiles et tablettes. Kyma, basé sur Kubernetes, propose des microservices et une architecture pilotée par les événements, idéale pour les charges de travail dynamiques. Les environnements Neo et ABAP sont moins adaptés aux applications frontales modernes et évolutives. À retenir : 'Cloud Foundry = applications évolutives à usage général', 'Kyma = microservices et événements'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/develop-applications-on-sap-btp-using-cloud-foundry",
        "https://help.sap.com/docs/btp/sap-business-technology-platform/kyma-runtime"
      ]
    },
    {
      "id": 109,
      "statement": "Lesquelles des étapes suivantes sont des étapes de processus dans la mise en service d'un modèle dans SAP Al Core ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Faire une inférence",
          "is_correct": true
        },
        {
          "statement": "Enregistrer le jeu de données d'entrée",
          "is_correct": false
        },
        {
          "statement": "Créer une instance Al Launchpad",
          "is_correct": true
        },
        {
          "statement": "Préparer les données",
          "is_correct": false
        }
      ],
      "explanation": "Dans SAP AI Core, la diffusion d'un modèle implique la création d'une instance AI Launchpad pour gérer les déploiements et faire des inférences à l'aide du modèle entraîné. Ces étapes s'inscrivent dans le cadre de l'opérationnalisation des modèles d'IA. 'L'enregistrement des jeux de données d'entrée 'et la 'préparation des données 'font généralement partie de la phase d'entraînement et ne servent pas. À retenir : 'Serving = Launchpad + Inference'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/develop-intelligent-scenarios-with-sap-ai-core-and-sap-ai-launchpad",
        "https://help.sap.com/docs/ai-core"
      ]
    },
    {
      "id": 110,
      "statement": "Quel est l'objectif principal de la phase IV de la méthodologie de conseil SAP en matière de données et d'analytique ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Développement de l'architecture de la solution",
          "is_correct": false
        },
        {
          "statement": "Revoir la gouvernance des données et créer une feuille de route",
          "is_correct": true
        },
        {
          "statement": "Analyse des résultats commerciaux et des exigences de la solution",
          "is_correct": false
        },
        {
          "statement": "Identifier les points faibles",
          "is_correct": false
        }
      ],
      "explanation": "La phase IV de la méthodologie de conseil SAP Data and Analytics se concentre sur l'examen de la gouvernance des données et la création d'une feuille de route. Cette phase permet de s'assurer que les politiques, la propriété et la conformité des données sont définies, et qu'un plan stratégique est en place pour la mise en œuvre. D'autres phases couvrent l'architecture, les exigences et les points faibles. À retenir : 'Phase IV = Gouvernance + Feuille de route'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/advise-on-data-and-analytics-strategy",
        "https://help.sap.com/docs/data-and-analytics-advisory-methodology"
      ]
    },
    {
      "id": 111,
      "statement": "Vous êtes un architecte de solutions et votre client a besoin d'aide pour choisir la solution SAP appropriée à utiliser pour la conception de ses applications. - SAP SuccessFactors déclenche un 'événement' lorsque les employés accomplissent diverses tâches telles que le changement d'adresse ou la mise à jour de leurs informations W-4. - L'événement sera détecté par l'une des solutions d'événements de SAP et déclenchera (via webhook) SAP Integration Suite ou SAP S/4HANA Cloud selon les besoins. - Le nombre d'événements traités ne devrait pas être élevé. - Une solution cloud est privilégiée. Lequel des éléments suivants pourrait être utilisé à la place de l'icône 'Placeholder' dans le diagramme ci-joint ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [
        "images/img_00006.bmp"
      ],
      "answers": [
        {
          "statement": "Suite d'intégration SAP, maillage d'événements avancé",
          "is_correct": false
        },
        {
          "statement": "SAP Event Broker",
          "is_correct": true
        },
        {
          "statement": "Maillage d'événements SAP",
          "is_correct": true
        },
        {
          "statement": "Orchestration des processus SAP",
          "is_correct": false
        }
      ],
      "explanation": "SAP Event Mesh et SAP Event Broker sont tous deux des solutions adaptées aux architectures pilotées par les événements dans SAP BTP. Dans ce scénario, où SAP SuccessFactors déclenche des événements (par exemple, des changements d'adresse), un courtier d'événements léger et natif du cloud est nécessaire pour acheminer ces événements vers SAP Integration Suite ou SAP S/4HANA Cloud. SAP Event Mesh est un service géré qui permet une communication asynchrone entre les applications à l'aide de protocoles de messagerie standard. Il est idéal pour découpler les services et assurer la fiabilité de la livraison d'événements. SAP Event Broker est un terme plus général souvent utilisé pour décrire le composant de gestion des événements qui peut recevoir, acheminer et distribuer des événements. Il est également utilisé dans la documentation SAP pour faire référence à la couche de gestion des événements dans SAP BTP. SAP Integration Suite, un maillage d'événements avancé, est plus adapté aux scénarios à haut débit à l'échelle de l'entreprise, ce qui n'est pas nécessaire ici. SAP Process Orchestration est une solution middleware sur site et non cloud-native, ce qui la rend moins adaptée à ce cas d'utilisation. 💡 Astuce mémoire : pour une gestion légère et native des événements cloud, pensez 'SAP Event Mesh '. Pour l'héritage ou sur site, pensez à l'orchestration des processus.",
      "Source_URL": [
        "https://help.sap.com/docs/event-mesh",
        "https://learning.sap.com/learning-journey/developing-with-sap-extension-suite/event-driven-architecture-in-sap-btp"
      ]
    },
    {
      "id": 112,
      "statement": "Que permet l'automatisation des processus robotiques (RPA) dans SAP Build Process Automation ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Automatisation des tâches manuelles.",
          "is_correct": true
        },
        {
          "statement": "Uniquement l'automatisation des processus financiers.",
          "is_correct": false
        },
        {
          "statement": "Accent exclusif sur l'automatisation du support client.",
          "is_correct": false
        },
        {
          "statement": "Réalisation manuelle de toutes les tâches.",
          "is_correct": false
        }
      ],
      "explanation": "L'automatisation des processus robotiques (RPA) dans SAP Build L'automatisation des processus permet l'automatisation des tâches manuelles répétitives basées sur des règles. Il permet aux bots d'imiter les interactions humaines avec les systèmes logiciels, comme cliquer sur des boutons, saisir des données ou lire sur des écrans. Cela réduit considérablement l'effort manuel, augmente l'efficacité et minimise les erreurs. La bonne réponse est 'Automatisation des tâches manuelles '. Les autres options sont incorrectes, car la RPA ne se limite pas aux processus financiers ou au support client, il s'agit d'un outil d'automatisation à usage général. De plus, la RPA est l'opposé de l'achèvement manuel des tâches. 💡 Astuce mémoire : RPA = Le robot effectue le travail répétitif automatiquement.",
      "Source_URL": [
        "https://help.sap.com/docs/build-process-automation",
        "https://learning.sap.com/learning-journey/automate-processes-with-sap-build-process-automation"
      ]
    },
    {
      "id": 113,
      "statement": "Quels sont les principaux avantages de l'architecture d'entreprise ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Augmenter le nombre de licences de logiciels.",
          "is_correct": false
        },
        {
          "statement": "Réduire la complexité organisationnelle.",
          "is_correct": true
        },
        {
          "statement": "Aligner la stratégie informatique sur les objectifs commerciaux.",
          "is_correct": true
        },
        {
          "statement": "Limiter l'innovation en entreprise.",
          "is_correct": false
        },
        {
          "statement": "Diminution des salaires des employés.",
          "is_correct": false
        }
      ],
      "explanation": "L'architecture d'entreprise (EA) fournit un cadre stratégique pour aligner l'infrastructure et les processus informatiques sur les objectifs commerciaux. Deux avantages clés sont les suivants : (1) réduire la complexité organisationnelle en normalisant et en rationalisant les applications et les processus, et (2) aligner la stratégie informatique sur les objectifs commerciaux pour s'assurer que les investissements technologiques soutiennent les résultats commerciaux. Les mauvaises options, telles que l'augmentation des licences logicielles, la limitation de l'innovation ou la diminution des salaires, ne sont pas des objectifs d'EA. 💡 Astuce mémoire : EA = efficacité + alignement.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/enterprise-architecture-in-the-era-of-sap-btp",
        "https://community.sap.com/topics/enterprise-architecture"
      ]
    },
    {
      "id": 114,
      "statement": "Quel est l'avantage clé de l'utilisation de connecteurs ouverts ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Augmentation de la configuration manuelle",
          "is_correct": false
        },
        {
          "statement": "Intégration simplifiée avec des applications tierces",
          "is_correct": true
        },
        {
          "statement": "Limité aux solutions sur site",
          "is_correct": false
        },
        {
          "statement": "Pas de support pour les applications tierces",
          "is_correct": false
        },
        {
          "statement": "Limité aux applications SAP uniquement",
          "is_correct": false
        }
      ],
      "explanation": "Les connecteurs ouverts dans SAP Integration Suite simplifient l'intégration avec des applications tierces en fournissant des connecteurs prédéfinis et une couche API unifiée. Cela réduit le besoin de développement personnalisé et de configuration manuelle. La bonne réponse est 'Intégration simplifiée avec des applications tierces '. Les autres options sont incorrectes, car les connecteurs ouverts ne sont pas limités aux systèmes SAP ou sur site, et ils réduisent, et non augmentent, la configuration manuelle. 💡 Astuce mémoire : Ouvrir les connecteurs = Ouvrez facilement la porte des applications externes.",
      "Source_URL": [
        "https://help.sap.com/docs/integration-suite/open-connectors",
        "https://learning.sap.com/learning-journey/integrate-applications-using-sap-integration-suite"
      ]
    },
    {
      "id": 115,
      "statement": "Quel est le principal avantage de l'automatisation d'entreprise pour les processus d'entreprise ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Traitement manuel de toutes les transactions commerciales.",
          "is_correct": false
        },
        {
          "statement": "Limiter l'automatisation aux seules solutions sur site.",
          "is_correct": false
        },
        {
          "statement": "Optimiser les processus de bout en bout grâce à l'intégration complète de SAP et d'applications tierces.",
          "is_correct": true
        },
        {
          "statement": "Se concentrant exclusivement sur l'automatisation du marketing.",
          "is_correct": false
        }
      ],
      "explanation": "L'automatisation d'entreprise vise à optimiser les processus métier de bout en bout en intégrant SAP et des applications tierces. Cela permet d'améliorer l'efficacité, de réduire les efforts manuels et de prendre de meilleures décisions. La bonne réponse est 'Optimiser les processus de bout en bout grâce à l'intégration complète de SAP et d'applications tierces '. Les autres options sont incorrectes car l'automatisation n'est pas limitée au on-premise ou au marketing, et elle n'implique pas de traitement manuel. 💡 Astuce mémoire : Automatisation d'entreprise = optimisation de bout en bout.",
      "Source_URL": [
        "https://learning.sap.com/learning-journey/automate-processes-with-sap-build-process-automation",
        "https://community.sap.com/topics/enterprise-automation"
      ]
    },
    {
      "id": 116,
      "statement": "Selon la méthodologie de conseil en matière de solutions d'intégration SAP, l'architecte d'intégration est responsable de laquelle des activités suivantes ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Mise en œuvre et extension de scénarios d'intégration pré-packagés",
          "is_correct": false
        },
        {
          "statement": "Évaluation des nouvelles technologies/services d'intégration",
          "is_correct": false
        },
        {
          "statement": "Définition, communication et amélioration continue d'une architecture d'intégration de référence basée sur une stratégie informatique globale",
          "is_correct": false
        },
        {
          "statement": "Définition d'architectures techniques d'intégration avec un focus sur des technologies/services d'intégration spécifiques",
          "is_correct": true
        }
      ],
      "explanation": "La bonne réponse est : 'Définition d'architectures techniques d'intégration avec un focus sur des technologies/services d'intégration spécifiques'. Selon la méthodologie ISA-M (SAP Integration Solution Advisory Methodology), l'architecte d'intégration joue un rôle central dans la définition de l'architecture d'intégration technique. Cela inclut la sélection des technologies et des services d'intégration appropriés en fonction de l'environnement informatique et des objectifs stratégiques de l'entreprise. Bien que les tâches de mise en œuvre et d'évaluation puissent être effectuées par d'autres rôles tels que les développeurs ou les architectes de solutions, l'architecte d'intégration s'assure que l'architecture s'aligne sur les exigences commerciales et techniques. Les options incorrectes telles que 'Mise en œuvre et extension de scénarios d'intégration pré-packagés 'sont généralement gérées par les développeurs d'intégration, et non par les architectes. Pour s'en souvenir, associez l'architecte à 'la conception et la stratégie', et non à 'l'exécution '.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/integrate-your-solution-landscape-using-sap-integration-suite",
        "https://community.sap.com/topics/integration-suite"
      ]
    },
    {
      "id": 117,
      "statement": "Lequel des éléments suivants est un composant principal du modèle de programmation d'applications ABAP RESTful ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Objets commerciaux",
          "is_correct": true
        },
        {
          "statement": "Objets de communication",
          "is_correct": false
        },
        {
          "statement": "Objets de développement",
          "is_correct": false
        },
        {
          "statement": "Objets de déploiement",
          "is_correct": false
        }
      ],
      "explanation": "La bonne réponse est : 'Business Objects'. Dans le modèle de programmation d'applications (RAP) ABAP RESTful, les objets métier sont des composants centraux qui encapsulent la logique et les données métier. Ils sont utilisés pour définir le comportement et la structure des applications de manière propre et réutilisable. D'autres options telles que 'Objets de communication', 'Objets de développement 'et 'Objets de déploiement 'ne sont pas des composants reconnus dans la terminologie RAP. Pour s'en souvenir, considérez RAP comme un modèle qui s'articule autour des 'Business Objects' pour garantir un noyau propre et une architecture orientée services.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/develop-apps-with-abap-restful-application-programming-model",
        "https://help.sap.com/docs/abap-cloud"
      ]
    },
    {
      "id": 118,
      "statement": "Quelle est la première phase de la méthodologie de conseil SAP Data and Analytics ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Résultats commerciaux et exigences de la solution",
          "is_correct": false
        },
        {
          "statement": "Carte des capacités et architecture de la solution",
          "is_correct": false
        },
        {
          "statement": "Gouvernance des données et feuilles de route",
          "is_correct": false
        },
        {
          "statement": "Cadrage et analyse de base",
          "is_correct": true
        }
      ],
      "explanation": "La bonne réponse est : 'Cadrage et analyse de base'. Il s'agit de la première phase de la méthodologie de conseil SAP Data and Analytics. Il s'agit de comprendre l'état actuel des données et des capacités d'analyse, d'identifier les points faibles et de définir la portée de la transformation. D'autres phases telles que 'Résultats commerciaux et exigences de la solution 'et 'Carte des capacités et architecture de la solution 'viennent plus loin dans la méthodologie. Pour mémoriser l'ordre, pensez à l'acronyme SBCD : Scoping, Business outcomes, Capability map, Data governance.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/transform-your-business-with-data-and-analytics",
        "https://community.sap.com/topics/data-analytics"
      ]
    },
    {
      "id": 119,
      "statement": "Dans quelle phase de la méthodologie de conseil SAP Data and Analytics l'architecture de la solution cible est-elle développée ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Phase III : Carte des capacités et architecture de la solution",
          "is_correct": true
        },
        {
          "statement": "Phase IV : Gouvernance des données et feuilles de route",
          "is_correct": false
        },
        {
          "statement": "Phase I : Cadrage et analyse de base",
          "is_correct": false
        },
        {
          "statement": "Phase II : Résultats opérationnels et exigences de la solution",
          "is_correct": false
        }
      ],
      "explanation": "La bonne réponse est : 'Phase III : Carte de capacité et architecture de la solution'. Au cours de cette phase, l'architecture de la solution cible est développée en fonction des exigences opérationnelles identifiées précédemment. Il s'agit notamment de mettre en correspondance les capacités avec les résultats de l'entreprise et de concevoir l'architecture qui les prend en charge. D'autres phases, comme la phase I (cadrage) et la phase II (exigences), sont préparatoires, tandis que la phase IV se concentre sur la gouvernance et les feuilles de route. Pour s'en souvenir, associez la Phase III à 'Cartographie et Modélisation'.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/transform-your-business-with-data-and-analytics",
        "https://help.sap.com/docs/data-analytics"
      ]
    },
    {
      "id": 120,
      "statement": "Comment la RPA dans SAP Build Process Automation aide-t-elle à optimiser les processus métier ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "En automatisant uniquement les processus financiers.",
          "is_correct": false
        },
        {
          "statement": "En fournissant des outils no-code pour la gestion des flux de travail et l'automatisation des processus robotisés.",
          "is_correct": true
        },
        {
          "statement": "En exigeant un codage complexe pour chaque automatisation.",
          "is_correct": false
        },
        {
          "statement": "En se concentrant uniquement sur l'automatisation du marketing.",
          "is_correct": false
        }
      ],
      "explanation": "La bonne réponse est : 'En fournissant des outils no-code pour la gestion des flux de travail et l'automatisation des processus robotiques'. SAP Build Process Automation permet aux utilisateurs professionnels d'automatiser les tâches et les flux de travail répétitifs sans avoir besoin de compétences techniques approfondies. Il combine la RPA avec des capacités de flux de travail et offre une interface visuelle pour la conception de l'automatisation. Des options incorrectes telles que 'automatiser uniquement les processus financiers 'ou 'nécessiter un codage complexe 'dénaturent la flexibilité et la facilité d'utilisation de l'outil. Pour vous en souvenir, considérez SAP Build comme une 'automatisation sans code pour tous '.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/automate-business-processes-with-sap-build-process-automation",
        "https://community.sap.com/topics/build-process-automation"
      ]
    },
    {
      "id": 121,
      "statement": "Quel est le principal avantage d'utiliser la suite d'extensions de SAP BTP pour le développement d'applications ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Il est conçu exclusivement pour le développement basé sur ABAP",
          "is_correct": false
        },
        {
          "statement": "Il permet le développement d'extensions qui s'intègrent parfaitement aux applications SAP sans modifier le système de base",
          "is_correct": true
        },
        {
          "statement": "Il fournit des applications pré-construites qui peuvent être déployées sans personnalisation",
          "is_correct": false
        },
        {
          "statement": "Il fournit des outils d'analyse intégrés pour la surveillance des applications",
          "is_correct": false
        }
      ],
      "explanation": "Le principal avantage de l'utilisation de la suite d'extensions de SAP BTP est sa capacité à développer des extensions qui s'intègrent de manière transparente aux applications SAP sans modifier le système de base. Cette approche s'aligne sur le principe du 'noyau propre 'de SAP, qui favorise le maintien de la stabilité et de la propreté du cœur numérique tout en permettant l'innovation grâce à l'extensibilité côte à côte. La suite d'extensions fournit des outils tels que SAP Business Application Studio, SAP Cloud Application Programming Model (CAP) et SAP Fiori pour la création d'applications évolutives et faciles à gérer. Des options incorrectes telles que le développement ABAP uniquement ou les applications prédéfinies sans personnalisation ne reflètent pas la flexibilité et l'extensibilité offertes par la suite. Conseil mémoire : Pensez à des 'extensions propres et flexibles'lorsque vous envisagez SAP BTP Extension Suite.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/develop-side-by-side-extensions-on-sap-btp",
        "https://community.sap.com/topics/btp-extension-suite"
      ]
    },
    {
      "id": 122,
      "statement": "Quel outil de SAP Signavio aide à identifier les inefficacités des processus ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Journaux de saisie manuelle.",
          "is_correct": false
        },
        {
          "statement": "Formulaires de commentaires des clients.",
          "is_correct": false
        },
        {
          "statement": "Logiciel exclusif sur site.",
          "is_correct": false
        },
        {
          "statement": "Informations sur le processus.",
          "is_correct": true
        }
      ],
      "explanation": "SAP Signavio Process Insights est l'outil conçu pour identifier les inefficacités des processus. Il fournit des informations en temps réel sur les performances des processus métier et sur les goulets d'étranglement ou les écarts. Cela permet aux organisations de hiérarchiser les domaines d'amélioration et de se comparer aux normes de l'industrie. D'autres options telles que les journaux manuels ou les commentaires des clients ne sont pas des outils analytiques et n'offrent pas d'informations automatisées. Process Insights s'intègre aux systèmes SAP pour extraire des données opérationnelles et visualiser les indicateurs de performance. Conseil de mémoire : 'Les informations révèlent les inefficacités ': Process Insights est le moteur analytique de SAP Signavio.",
      "Source_URL": [
        "https://www.signavio.com/products/process-insights/",
        "https://learning.sap.com/learning-journeys/transform-business-processes-with-sap-signavio"
      ]
    },
    {
      "id": 123,
      "statement": "Quel est l'objectif principal de SAP BTP ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Pour réduire l'utilisation des services cloud.",
          "is_correct": false
        },
        {
          "statement": "Pour limiter l'accessibilité des données.",
          "is_correct": false
        },
        {
          "statement": "Pour gérer la paie des employés.",
          "is_correct": false
        },
        {
          "statement": "Intégrer, étendre et innover des applications.",
          "is_correct": true
        }
      ],
      "explanation": "SAP BTP (Business Technology Platform) est conçu pour intégrer, étendre et innover des applications sur des systèmes SAP et tiers. Il fournit des services de gestion de données, d'analyse, de développement d'applications et d'intégration. La bonne réponse reflète cet objectif holistique. D'autres options comme la gestion de la paie ou la limitation de l'utilisation du cloud ne sont pas alignées avec le rôle stratégique de SAP BTP. SAP BTP permet aux entreprises de créer des solutions intelligentes et évolutives tout en conservant un cœur propre. Conseil de mémoire : 'BTP = Build, Transform, Platform'- il s'agit d'intégration, d'extension et d'innovation.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/explore-sap-business-technology-platform",
        "https://www.sap.com/products/technology-platform.html"
      ]
    },
    {
      "id": 124,
      "statement": "Quel rôle joue SAP Data Intelligence dans l'architecture de SAP BTP ?",
      "guidelines": "Il y a 2 bonnes réponses à cette question.",
      "image_ids": [],
      "answers": [
        {
          "statement": "Fournit des outils pour la construction et le déploiement de modèles d'apprentissage automatique",
          "is_correct": true
        },
        {
          "statement": "Facilite l'intégration et l'orchestration des données entre différents systèmes",
          "is_correct": true
        },
        {
          "statement": "Offre des capacités d'analyse en temps réel",
          "is_correct": false
        },
        {
          "statement": "Sert de plate-forme principale pour la gestion des données de référence",
          "is_correct": false
        }
      ],
      "explanation": "SAP Data Intelligence joue un double rôle dans l'architecture de SAP BTP : elle facilite l'intégration et l'orchestration des données à travers des systèmes hétérogènes et fournit des outils pour construire et déployer des modèles de machine learning. Il connecte les sources de données structurées et non structurées, ce qui permet d'établir des pipelines de données et une gouvernance. Les options incorrectes telles que l'analyse en temps réel ou la gestion des données de référence sont gérées par d'autres outils SAP tels que SAP HANA ou SAP MDG. Conseil de mémoire : 'Data Intelligence = Intégration + ML' : considérez-le comme le pont et le cerveau des données dans SAP BTP.",
      "Source_URL": [
        "https://learning.sap.com/learning-journeys/manage-data-pipelines-with-sap-data-intelligence-cloud",
        "https://help.sap.com/docs/data-intelligence"
      ]
    },
    {
      "id": 125,
      "statement": "Quelle partie de l'architecture SAP Al est responsable de la fourniture des données en temps réel spécifiques à l'entreprise pour permettre la récupération ?",
      "guidelines": "Veuillez choisir la bonne réponse.",
      "image_ids": [],
      "answers": [
        {
          "statement": "SAP AI Core ( ???)",
          "is_correct": false
        },
        {
          "statement": "Moteur vectoriel SAP HANA Cloud(X)",
          "is_correct": false
        },
        {
          "statement": "Pôle d'IA générative ( ?)",
          "is_correct": false
        },
        {
          "statement": "SAP Joule (X)",
          "is_correct": true
        }
      ],
      "explanation": "SAP Joule est l'assistant d'IA générative intégré dans les applications SAP qui fournit des données en temps réel, spécifiques à l'entreprise, pour permettre une récupération et une prise de décision intelligentes. Il exploite les données contextuelles des systèmes SAP pour fournir des informations et automatiser les tâches. D'autres options, telles que SAP AI Core ou le moteur vectoriel HANA, prennent en charge l'exécution de modèles ou le stockage de données, mais ne servent pas de couche d'intelligence orientée utilisateur. Conseil de mémoire : 'Joule = le cerveau de l'IA de SAP' : c'est l'assistant qui comprend le contexte de l'entreprise et fournit des réponses.",
      "Source_URL": [
        "https://www.sap.com/products/artificial-intelligence/joule.html",
        "https://news.sap.com/2023/09/sap-unveils-joule-generative-ai-assistant/"
      ]
    }
  ]
}
